[
  {
    "path": "posts/patolojide-bilisim/",
    "title": "Patolojide Bilişim",
    "description": "Bu yazı *Prof. Dr. Alp Usubütün* editörlüğünde hazırlanan *\"Sağlık Bilimleri İçin Patoloji ve Patoloji Laboratuvarını Anlama Kılavuzu 2. Baskı - Ekim 2022 Ankara Nobel Tıp Kitabevleri ISBN: 978-625-7564-70-0\"* adlı kitaptaki *\"8. Bölüm: Patolojide Yeni Yöntemler ve Gelecek\"* için hazırlanmıştır. Ancak bu alanın çok hızlı ilerlemesi nedeniyle bu metni güncel tutmak (ve bir sonraki baskı için gerekirse hazır bulunmak için) metin içeriği burada güncellenecektir.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2024-11-14",
    "categories": [
      "patoloji",
      "bilişim",
      "patolojinin geleceği",
      "yapay zeka",
      "otomasyon",
      "bilgi yönetim sistemi",
      "dijital patoloji"
    ],
    "contents": "\r\nPatoloji ve Bilişim\r\nSerdar Balcı\r\n2024-07-28\r\nPatoloji ve Bilişim\r\nPatolojide Bilişimin yeri\r\nnedir?\r\nPatolojideki Bilgi Türleri\r\nNelerdir?\r\nDijital Patoloji Nedir?\r\nDijital Patolojinin Geleceği\r\nYapay Zekanın Dijital Patolojideki\r\nYeri\r\nİlginç ve örnek çalışmalar\r\n\r\nReferanslar ve okuma Önerileri\r\nReferanslar\r\nOkuma önerileri:\r\nAçık kaynak kodlu veya ücretsiz dijital patoloji\r\nprogramları:\r\nVideolar\r\n\r\nPatoloji ve Bilişim\r\n\r\nhttps://zenodo.org/badge/latestdoi/594820002\r\nDOI 10.17605/OSF.IO/BRZUF\r\n\r\nBu yazı Prof. Dr. Alp Usubütün editörlüğünde hazırlanan “Sağlık\r\nBilimleri İçin Patoloji ve Patoloji Laboratuvarını Anlama Kılavuzu 2.\r\nBaskı - Ekim 2022 Ankara Nobel Tıp Kitabevleri ISBN:\r\n978-625-7564-70-0”\r\n1 2 adlı kitaptaki “8. Bölüm: Patolojide Yeni Yöntemler ve\r\nGelecek”3 için hazırlanmıştı r. Ancak bu alanın çok hızlı\r\nilerlemesi nedeniyle bu metni güncel tutmak (ve bir sonraki baskı için\r\ngerekirse hazır bulunmak için) metin içeriği burada güncellenecekti r.\r\nDoç. Dr. Serdar Balcı\r\n\r\n\r\nPatolojide Bilişimin yeri nedir?\r\nPatologları, hastanın klinik bilgilerini, makroskopi ve mikroskopik\r\ngörüntüler ile işleyip, literatür ve bilimsel bilgiler ışığında\r\nyorumlayan ve rapor adlı yazılı bilgiyi üreten bilgi uzmanları olarak\r\ntanımlayabiliriz. Abartılı bir tarif gibi görünse de çoğu hasta\r\ndosyasında, hasta hakkında en çok ve en doğru (hatta hala daha altın\r\nstandart) bilgiler patologların ürettiği patoloji raporlarında yer\r\nalmaktadır.\r\nBilginin teknoloji kullanılarak işlenmesindeki gelişmeleri, patoloji\r\ndisiplini, bazen geriden bazen öncü olarak, ama emin adımlarla takip\r\netmekte ve kendi işleyişine katmaktadır. (Computational Pathology: A\r\nPath Ahead https://pubmed.ncbi.nlm.nih.gov/26098131/)\r\nBilimsel bilginin sürekli artması,\r\nhemen her yıl yeni bir DSÖ sınıflama kitabının çıkması,\r\nyeni çıkan antikorların ve yöntemlerin tanısal test olarak\r\nkullanımındaki istatistiksel yöntemler,\r\ntümörlerin taksonomisi,\r\n“ben buna displazi derim” gibi sezgisel yaklaşımlar,\r\nklinik bilgilerin elde edilmesi,\r\nmakroskopik ve mikroskopik görüntülerin elde edilmesi, işlenmesi ve\r\nsaklanması,\r\nrapor yazılması,\r\ndiktasyon,\r\nraporların saklanması,\r\narşivleme,\r\nlaboratuvar iş akışının düzenlenmesi ve takibi\r\ngibi bir çok basamakta yer alan bilişim teknolojileri, dijital\r\npatolojinin yaygınlaşması ile makina öğrenmesi, derin öğrenme ve yapay\r\nzeka ile karar destek sistemleri olarak günlük pratiğe daha da\r\ngirmektedir.\r\nPatoloji raporları ve görüntüleri için kullanılan yazılımlar (Rosai 1.\r\nchapter)’da belirtildiği gibi çoğu zaman diğer laboratuvar branşları ya\r\nda radyoloji için hazırlanmış platformlara eklemlenmiş gibidirler.\r\nPatolojinin işleyişi ile çoğu zaman örtüşmeyen yazılımlar, çoğu zaman\r\nbir metin işlemcisi ve faturalandırma aracı olarak kalmaktadırlar.\r\nPatoloji raporları ve görüntüleri için kullanılan yazılımlar (Rosai 1.\r\nchapter)’da belirtildiği gibi çoğu zaman diğer laboratuvar branşları ya\r\nda radyoloji için hazırlanmış platformlara eklemlenmiş gibidirler.\r\nPatolojinin işleyişi ile çoğu zaman örtüşmeyen yazılımlar, çoğu zaman\r\nbir metin işlemcisi ve faturalandırma aracı olarak\r\nkalmaktadırlar.Patolojideki Bilgi Türleri Nelerdir?\r\nPatolojide bilgi türleri temel olarak laboratuvar iş akışı, metin ve\r\ngörüntülerden oluşmaktadır.\r\nLaboratuvar İş Akışı\r\nMetin Bilgileri\r\nPatolojideki metin bilgilerini:\r\npatoloğa\r\nklinikten ve\r\nliteratürden gelen bilgiler ile\r\n\r\npatoloğun ürettiği raporlar oluşturmaktadır.\r\nBu bilgi türlerine belki sosyal medyayı da eklemek uygun olacaktır.\r\nSosyal medyada paylaşılan rutin ya da ilginç patoloji vakaları\r\nderlendiğinde bir patoloji kitabı oluşturmak mümkün olabilir 4.\r\nAyrıca bu veriler görüntü analizleri için bile kullanılabilmektedir\r\nPMID:37592105.\r\nGörüntüler\r\nMorfolojik analize dayanan anatomik patolojideki bilgilerden biri de\r\ngörüntülerdir. Makroskopik ve mikroskopik görüntüler mevcuttur.\r\n“Makroskopik” görüntülerin net bir şekilde elde edilmesi ve\r\nsaklanması giderek önem kazanmaktadır. Tariflenen bazı bulguların\r\n(mezorektal bütünlük gibi) daha sonra tekrar değerlendirilmesi, delici\r\nkesici yaralanmalar gibi mikroskopla belirlenemeyecek medikolegal\r\ndökümantasyonun sağlanması gibi nedenlerle, patoloji ve hastane bilgi\r\nsistemlerine entegre makroskopi resim saklama gerekliliği giderek\r\nartmaktadır.\r\nMakroskopik görüntülerin radyoloji ile korelasyonu ve üç boyutlu\r\ngörüntülerle sanal gerçeklik uygulamaları makroskopik görüntü arşivinin\r\nönemini giderek artırmaktadır.\r\n“Mikroskopik” görüntülerin tam yüzey taranması (whole slide\r\nimaging) ile hızlanan dijital patolojiye bir sonraki bölümde detaylı\r\ndeğinilecektir. Artık günümüzde;\r\ndokunun kesit almadan üç boyutlu haritalandırılması,\r\nfiziksel olarak boyanmadan sanal boyalar ile incelenmesi\r\nve bunların örnek yeterliliğinde ve hızlı tanıda kullanılması oldukça\r\nsık yapılan ve pratiğe geçeceği umulan çalışmalardır.\r\nİki boyutlu klasik mikroskopik görüntülerin çokça kesit alınarak 3\r\nboyutlu (3D) rekonstriksiyonu ile yapılan tümör modelleri, hastalıkların\r\npatofizyolojisinin anlaşılmasında yeni olanaklar sunacaktır.\r\nPatolojinin gelecegindeki yeni teknikler arasında\r\nüç boyutlu görüntüleme 5,\r\nRaman spektroskopisi (Movahed-Ezazi vd. 2023),\r\nFTIR (infrared spectroskop),\r\nsanal HE boyama,\r\nve konfokal mikroskopi gibi tekniklerin yer alması beklenmektedir.\r\nDijital Patoloji Nedir?\r\nDijital Patolojinin Kullanım Alanları Nelerdir?\r\nTanı\r\nEğitim\r\nKonsültasyon\r\nRutin Raporlama {rutin-raporlama}\r\nŞu an kullanılan ara yüzlerdeki farklılıklar da kullanım alışkanlığı\r\ngeliştirmeyi zorlaştırmaktadır.\r\n<–WIP–>\r\nBilgisayar fare orta tuş kilidi olan ve olmayan arayüzler\r\n(https://middleclick.app/), büyütme ve küçültme (zoom in/out)\r\nhızlarının klasik mikroskoplardan farklı olması yanısıra klavye ve\r\nbilgisayar bileşenlerine (oyunlara) aşina neslin kullandığı oklar,\r\naswd tuşlarının …\r\nnavigasyon ok tuşları, aswdrz, +- middle click scroll resim, görüntü\r\nkaydetme\r\nSectra, ViraSoft ve OpenSeaDragon arayüzlerindeki farklılıklar.\r\n<–WIP–>\r\nNasıl bir ekran kullanılacağı ve ekranın “tıbbi ekran” kategorisinde\r\nolup olmaması gerektiği de süregiden bir tartışma konusudur (Bkz. Leeds\r\nekran testi)\r\n<–WIP–>\r\nTek ya da çoklu monitörde çalışma, dokunmatik ekranlar\r\nekran çözünürlüğü, tepki süresi\r\nsanal mape çeşitleri\r\nlamın vertikal ya da horizontal taranması\r\ntaranan alanların işaretlenmesi (heatmap)\r\n<–WIP–>\r\nGünümüzde kaset, immünohistokimya ve tayarıcılardaki farklı barkod /\r\nkarekod / datamatrix kullanımı ve bu içeriğin firmalara özgün ve\r\ndeğiştirilemez olarak tanımlanması, kesintisiz bir laboratuvar iş akışı\r\nönündeki önemli engellerden biridir. Bu konuda firmalar arası\r\nentegrasyonun sağlanabilmesi oldukça önemlidir. Yakın zamanda Memorial\r\nPatoloji’de tüm basamaklardaki datamatrix kodları birleştirilmiş olup,\r\nimmünohistokimya cihazındaki entegrasyon da tamamlanmak üzeredir.\r\nDijital Patoloji İçin Tarayıcıya İhtiyacımız Var Mı?\r\nDijital Patolojinin Geleceği\r\nDijital patoloji hızla gelişen bir alan olduğundan patologların\r\nkendilerini bu gelişmelere hazırlamaları gerekmektedir.\r\nAltyapı yatırımları sırasında geliştirilebilir modüler yapıların tercih\r\nedilmesi; basit ekran paylaşımından öteye gitmeyen ve açık kaynak ile\r\nulaşılabilecek programlar için masraf yapmadan önce yetkin görüş\r\nalınması önerilmektedir.\r\nDijital patoloji görüntüleri şu an farklı firmalara ait farklı formatlar\r\nhalindedir. Ancak yakın zamanda ortak bir format olan DICOM’a\r\ngeçilmesi ile cihazlar arasındaki uyum da artacaktır. Bu ortak formata\r\ngeçilmesi ile görüntülerin daha uygun saklanabilmesi için de\r\ngeliştirmeler hızlanacaktır.\r\nDijital patoloji sadece mikroskopik görüntülerin bilgisayar ortamına\r\naktarılması olarak düşünülmemeli. Dijital patoloji ile tüm patolojide\r\nüretilen tüm bilginin kullanılabilir veri haline getirilmesi ve\r\nbunların hastanın diğer bilgileri ile entegre edilmesi\r\nhedeflenmelidir.\r\nYöneticilerin dijital patoloji kurulum hevesleri sırasında, patologlar\r\nfırsatı ganimet bilip laboratuvarın eksiklerini tamamlatmalı ve\r\nkaliteyi artırıcı düzenlemeleri uygulatmalıdırlar.\r\nYeni çıkan immünohistokimyasal tetkiklerin belli bir süre sonra\r\ntanısal özgünlüklerini kaybetmeleri patologları yeni testlere karşı\r\nşüpheli yaklaşmaya zorlamıştır. Aynı şüpheyi yapay zeka algoritmaları\r\niçin de kullanmak gereklidir. Yakın zamanda çok sayıda başarılı olduğu\r\niddia edilen algoritma yayınlanmış olmasına karşın bunların kliniğe\r\naktarımı hala kısıtlıdır. Yayın ve araştırma bolluğu ile birlikte;\r\nyapay zeka modellerinin aynı laboratuvardaki tekrarlanabilirlikleri ve\r\nbaşka laboratuvar verilerine aktarılabilirlikleri çok önemli bir\r\nproblem olarak ortaya çıkmaya başlamıştır.\r\nPatoloji asistanları açık kaynak kodlu dijital patoloji programlarını\r\nkullanmayı öğrenmeli ve açık kaynak kodlu yazılımlar konusunda dijital\r\nokur yazarlıklarını geliştirmelidirler.\r\nMeslek örgütleri radyolojide yaşanan “hizmet alımı” süreci ile\r\n“uzaktan tanı” adı altında düşürülen sağlık hizmeti kalitesi ve\r\ndeğersizleştirilen hekim emeğinin farkında olmalı ve buna yönelik\r\ntedbir ve tavsiyeler için hazırlanmalıdırlar.\r\nTarayıcıların, PACS depolarının ve arayüzlerin birbiri ile uyumu\r\noldukça önemlidir. ICC profillerinin 6 7 uyumu görüntülerin son\r\nkullanıcı olan patolog tarafından değerlendirmesinde önem taşımaktadır\r\n.\r\nYapay zeka algoritma sağlayıcılarının, laboratuvarda hali hazırda\r\nbulunan PACS ve arayüz ile uyum sağlayamaması ve entegrasyon için ayrı\r\nemek ve maliyet gerekmesi de dijital patolojinin gelişimindeki\r\nengellerdendir.\r\nÜretilen yapay zeka algoritmaları firmaların sadece kendi\r\narayüzlerinde ve bulut sistemlerinde çalışmaktadır. Bu sistemler\r\n“vendor agnostic” hale henüz gelememişlerdir.\r\nYapay Zekanın Dijital Patolojideki Yeri\r\nYapay zekanın görüntüler üzerindeki tecrübesinin patolojiye aktarılması\r\nile bilimsel çalışmalarda sık görmeye başladığımız yapay zeka (makina\r\nöğrenmesi, derin öğrenme) kullanımı giderek günlük pratiğe de\r\nuygulanabilecek özellikler kazanmaktadır. Yapay zeka ile ilgili\r\nçalışmalar literatürde hesaplamalı/sayısal patoloji (computational\r\npathology), matematiksel patoloji olarak da geçmektedir.\r\nYapay zeka ile ilgili beklentilerin realist olması, algoritmaların ise\r\ntekrarlanabilir (kendi içinde ve dışarıyla tutarlı),\r\nteknik olarak uygulanabilir,\r\nklinik pratiğe aktarılabilir ve\r\nyeni bilgiler ışığında güncellenebilir olması gerekmektedir.\r\nYapay zeka modellerinin nasıl geliştirildiği oldukça önemlidir.\r\nTCGA verisinde hatalar olduğu (Murat 2024 USCAP abstract)\r\nDoku bulaşlarının model başarılarını etkilediği Irmakci vd. (2024)\r\nunutulmamalıdır.\r\nGeliştirilmekte olan, temel modeller (foundation models) üzerine inşa\r\nedilen modeller (fine-tuning) ile patolojide yapay zeka uygulamaları\r\nyaygınlaşacaktır. 8\r\nhttps://doi.org/10.1016/j.jpi.2024.100375\r\nhttps://arxiv.org/abs/2312.07814\r\nÇok modlu bir üretken yapay zeka modeli olan “PathChat 2”9 de\r\npatolojiye özel bir chatGPT10 olarak hayatımızda yer almaya aday\r\nmodellerdendir .\r\nTowards a general-purpose foundation model for computational pathology\r\nhttps://www.nature.com/articles/s41591-024-02857-3\r\nA visual-language foundation model for computational pathology\r\nhttps://www.nature.com/articles/s41591-024-02856-4\r\nA Multimodal Generative AI Copilot for Human Pathology\r\nhttps://www.nature.com/articles/s41586-024-07618-3\r\nGelecekte her mikroskopta bir kameranın olduğu, masabaşında hemen\r\nulaşılabilecek tarama cihazlarının olduğu çalışma ortamı yanısıra,\r\ntamamen mikroskopsuz patoloji iş istasyonları da olacaktır.\r\nAlgoritma destekli patoloji pratiğinde ‘Bu vakayı Alp Hoca’ya danışalım’\r\nyerine ‘Bu vakayı AlpApp v25’e yükleyelim’ gibi cümleler yer alacağı\r\ngibi, ihtiyaca göre uygulama indirilen / geliştirilen PathAppStore’ları\r\nda hayatımızdaki yeniliklerden olacaktır.\r\nTüm bu gelişmeler ışığında gelecekte, bilişimin, metin-görüntü işleme ve\r\nyapay zekanın patoloji bölümleri içinde bir alt grup olarak\r\nyerleşeceğini ve patoloji laboratuvarlarında bilişim sektöründen de\r\nçalışanlar olacağı tahmin edilmektedir.\r\nİlginç ve örnek çalışmalar\r\nQuPath\r\nQuPath’ın WSinfer adlı eklentisi ile literatürdeki yapay zeka\r\nmodellerini kendi vakalarımızda kolayca uygulamak mümkün. 11\r\n\r\nI am really enthusiastic about the #wsinfer plugin of #qupath Now it\r\nwill be possible to try published models of digital pathology on my\r\ncases without having to find data or code “upon reasonable request”,\r\nor try correct the corrupt code on github. And now the “published\r\nmodels” will face the real world scenario. This will change the\r\n#digitalpathology and distinguish those models that really work from\r\nthose that work only on the paper. There is one great barrier\r\nremaining now, an open source program to make #WSI with a camera\r\nattached to a microscope. I wish I had the coding skills to do that :)\r\n\r\nGelecekte oldukça fazla QuPath kullanacağımızın bir göstergesi de Apple\r\nbilgisayar sunumlarında QuPath’ın örnek olarak yerini almasıdır.https://www.linkedin.com/feed/update/urn:li:activity:7125049439831916544/https://youtube.com/clip/UgkxMxu0lmNg-9TeX7W59sJXa1dm6nqysu6N?si=4uuz7qVoWqAhYuGp\r\nHistoQC\r\nOctopi\r\nOpenFlexure Microscope {sec-openflexure-microscope}\r\nhttps://openflexure.org/projects/microscope/\r\nPATHOLOGY RESIDENT EXPERIENCE USING A LOW-COST 3D PRINTED MICROSCOPE FOR\r\nPORTABLE DIGITAL PATHOLOGY https://doi.org/10.1016/j.jpi.2022.100043\r\nµManager {sec-micromanager}\r\nOpen Source Software for Control and Automation of Microscope Hardware\r\n12\r\nDiğer açık kaynak kodlu ve ücretsiz programların listesi okuma\r\nönerilerinde verilmiştir.\r\nReferanslar ve okuma Önerileri\r\nReferanslar\r\n\r\n\r\nIrmakci, Ismail, Ramin Nateghi, Rujoi Zhou, Mariavittoria Vescovo,\r\nMadeline Saft, Ashley E. Ross, Ximing J. Yang, Lee A. D. Cooper, ve\r\nJeffery A. Goldstein. 2024. “Tissue Contamination Challenges the\r\nCredibility of Machine Learning Models in Real World Digital Pathology”.\r\nModern Pathology, Ocak, 100422.\r\nhttps://doi.org/10.1016/j.modpat.2024.100422.\r\n\r\n\r\nMovahed-Ezazi, Misha, Mustafa Nasir-Moin, Camila Fang, Isabella\r\nPizzillo, Kristyn Galbraith, Steven Drexler, Olga A. Krasnozhen-Ratush,\r\nvd. 2023. “Clinical Validation of Stimulated Raman Histology for Rapid\r\nIntraoperative Diagnosis of CNS Tumors”. Modern Pathology, Mayıs,\r\n100219. https://doi.org/10.1016/j.modpat.2023.100219.\r\n\r\n\r\nOkuma önerileri:\r\nEuropean Society for Digital and Integrative Pathology\r\nhttps://digitalpathologysociety.org/\r\nDigital Pathology Association\r\nhttps://digitalpathologyassociation.org/\r\nempaia Academy https://en.empaia.org/academy-2-1\r\nPatoloji Atlası https://www.patolojiatlasi.com/\r\nHistopathology Atlas https://www.histopathologyatlas.com/\r\nPatoloji Notları https://www.patolojinotlari.com/\r\nQuPath https://qupath.github.io/ Bankhead, P. et al. QuPath: Open\r\nsource software for digital pathology image analysis. Scientific\r\nReports (2017). https://doi.org/10.1038/s41598-017-17204-5\r\nPete Bankhead, 2022, Introduction to Bioimage Analysis\r\nhttps://bioimagebook.github.io\r\nBest practice recommendations for implementing digital pathology, The\r\nRoyal College of Pathologists\r\nhttps://www.rcpath.org/uploads/assets/f465d1b3-797b-4297-b7fedc00b4d77e51/Best-practice-recommendations-for-implementing-digital-pathology.pdf\r\nThe Leeds Guide to Digital Pathology\r\nhttps://www.virtualpathology.leeds.ac.uk/research/clinical/docs/2018/pdfs/18778_Leeds%20Guide%20to%20Digital%20Pathology_Brochure_A4_final_hi.pdf\r\nLeeds ekran testi:\r\nhttps://www.virtualpathology.leeds.ac.uk/research/systems/pouqa/pathology/\r\nIntegrating digital pathology into clinical practice\r\nhttps://pubmed.ncbi.nlm.nih.gov/34599281/\r\nArtificial intelligence-the third revolution in pathology\r\nhttps://pubmed.ncbi.nlm.nih.gov/30270453/\r\nGrand Challenge A platform for end-to-end development of machine\r\nlearning solutions in biomedical imaging.\r\nhttps://grand-challenge.org/\r\nManual Whole Slide Imaging https://www.microvisioneer.com/\r\nPathoZoom Scan https://www.smartinmedia.com/pathozoom-scan/\r\nPallua JD, Brunner A, Zelger B, Schirmer M, Haybaeck J. The future of\r\npathology is digital Pathol Res Pract. 2020 Sep;216(9):153040. doi:\r\n10.1016/j.prp.2020.153040. Epub 2020 Jun 20. PMID: 32825928.\r\nPetascale Computational Pathology - Prof Nasir Rajpoot at HMS-BWH\r\nPathology Grand Rounds 5 Oct 2020\r\nhttps://www.youtube.com/watch?v=nVHRNn-nqMg\r\nAdvice from one of the world’s largest digital pathology\r\nimplementations\r\nhttps://medical.sectra.com/case/advice-from-one-of-the-worlds-largest-digital-pathology-implementations/\r\nOctopi: Octopi: Open configurable high-throughput imaging platform for\r\ninfectious disease diagnosis in the field Hongquan Li, Hazel\r\nSoto-Montoya, Maxime Voisin, Lucas Fuentes Valenzuela, Manu Prakash\r\nbioRxiv 684423; doi: https://doi.org/10.1101/684423\r\nOctopi’nin tanıtımı:\r\nhttps://twitter.com/prakashlab/status/1144453714637230083\r\nLesson from the COVID-19 pandemic: pathologists need to build their\r\nconfidence on working in a digital microscopy environment. Virchows\r\nArch 479, 227–229 (2021). https://doi.org/10.1007/s00428-021-03123-4\r\nValidating Whole Slide Imaging for Diagnostic Purposes in Pathology\r\nhttps://www.cap.org/protocols-and-guidelines/cap-guidelines/current-cap-guidelines/validating-whole-slide-imaging-for-diagnostic-purposes-in-pathology\r\nValidating Whole Slide Imaging Systems for Diagnostic Purposes in\r\nPathology: Guideline Update From the College of American Pathologists\r\nin Collaboration With the American Society for Clinical Pathology and\r\nthe Association for Pathology Informatics. Arch Pathol Lab Med 1 April\r\n2022; 146 (4): 440–450. doi:\r\nhttps://doi.org/10.5858/arpa.2020-0723-CP\r\nDigital Pathology & AI in routine clinical practice:From quality\r\ncontrol to primary cancer diagnosis\r\nhttps://www.youtube.com/watch?v=7pRmonus9iM\r\nAtallah, N.M., Toss, M.S., Verrill, C. et al. Potential quality\r\npitfalls of digitalized whole slide image of breast pathology in\r\nroutine practice. Mod Pathol (2021).\r\nhttps://doi.org/10.1038/s41379-021-01000-8\r\nAçık kaynak kodlu veya ücretsiz dijital patoloji programları:\r\nQuickAnnotator https://github.com/choosehappy/QuickAnnotator\r\nHistoQC https://github.com/choosehappy/HistoQC\r\nQuPath https://qupath.github.io/\r\nCytomine https://cytomine.be/\r\nOrbit https://www.orbit.bio/\r\nASAP https://computationalpathologygroup.github.io/ASAP/\r\nMicaia http://www.micaia.ai\r\nImageJ/ Fiji https://fiji.sc/\r\nImageScope\r\nhttps://www.leicabiosystems.com/digital-pathology/manage/aperio-imagescope/\r\nVideolar\r\nIntroduction to Bioimage\r\nAnalysis\r\nQuPath tutorial #1 - Getting\r\nstarted\r\nQuPath tutorial #2 - IHC\r\nanalysis\r\nQuPath Spring\r\n2022\r\nFrom Samples to Knowledge\r\n2020\r\nFrom Zero to QuPath\r\nHero\r\nPathLAKE Masterclasses\r\n2021\r\nTIA Centre Seminar\r\nSeries\r\nInvited Talks &\r\nPresentations\r\nECDP\r\n2019\r\nImage processing with\r\npython\r\nDijital Patoloji Webinar\r\nSerisi\r\nBreast Cancer KI67 assessment using with the open source\r\nQuPath\r\nQuPath\r\n\r\n\r\nProje Oluşturma\r\nQuPath\r\nprojects\r\n{{ video https://www.youtube.com/embed/wo9vZccmqwc title=“QuPath\r\nprojects” }}\r\nRenkleri Ayırma\r\n{{ video https://www.youtube.com/embed/Oe0rfzLtTO0 }}\r\n{{ video https://www.youtube.com/embed/IpCDnPnFvDc }}\r\nDokuların Tespiti\r\n{{ video https://www.youtube.com/embed/B03-TlH-yVU }}\r\nSegment Anything\r\n{{ video https://www.youtube.com/embed/J_ubK5x1vcU }}\r\nwsinfer\r\n{{ video https://www.youtube.com/embed/0Z589zWlFQQ }}\r\n↩︎\r\n↩︎\r\n↩︎\r\nPatoloji Notları↩︎\r\nAI-driven efficient patient prognosis based on 3D pathology\r\nsamples TIA Centre Seminar Series Dr. Andrew Song\r\nhttps://mamba-demo.github.io/demo/\r\nhttps://www.youtube.com/watch?v=rcNCHQnK454&ab_channel=TIAWarwick↩︎\r\nhttps://en.wikipedia.org/wiki/ICC_profile↩︎\r\nhttp://www.andrewjanowczyk.com/application-of-icc-profiles-to-digital-pathology-images/↩︎\r\nFoundation Models and Information Retrieval in Digital\r\nPathology↩︎\r\nhttps://www.modella.ai/intro.html↩︎\r\nhttps://chatgpt.com/↩︎\r\npreprint\r\ndocumentation-1\r\ndocumentation-2\r\nimage.sc\r\nlinkedIN↩︎\r\nhttps://micro-manager.org/\r\n\r\n↩︎\r\n",
    "preview": {},
    "last_modified": "2024-11-14T16:10:00+03:00",
    "input_file": {}
  },
  {
    "path": "posts/patoloji-calismalarinda-istatistik-icin-nasil-veri-hazirlanir/",
    "title": "Patoloji çalışmalarında istatistik için nasıl veri hazırlanır?",
    "description": "Toplantının video kaydı",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2024-04-16",
    "categories": [],
    "contents": "\r\n“Patoloji çalışmalarında istatistik için nasıl veri hazırlanır?” konulu toplantıyı yaptık:\r\nPatoloji Çalışmalarında İstatistik İçin Veri Hazırlama\r\n\r\n\r\nGeri bildirimlerinizi ve ilerideki toplantılar için önerilerinizi bekliyorum:\r\nhttps://forms.gle/qhQ7aGpdC6Pn7f1c9\r\n\r\nLoading…\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2024-04-27T18:43:24+03:00",
    "input_file": {}
  },
  {
    "path": "posts/rutinde-dijital-patoloji-zorluklar-kolayliklar/",
    "title": "Rutinde Dijital Patoloji: Zorluklar ve Kolaylıklar",
    "description": "Dijital Patoloji Webinar serisinin üçüncüsünde yaptığım sunum.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2023-09-27",
    "categories": [],
    "contents": "\r\nRutinde Dijital Patoloji: Zorluklar ve Kolaylıklar. 27 Eylül 2023. Türk Patoloji Derneği Dijital Webinar Serisi-3 Dijital Patolojinin Rutinde Kullanımı\r\n\r\nhttps://www.youtube.com/watch?v=xlxfSO-zSrA&ab_channel=SERDARBALCI\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-10-01T12:42:57+03:00",
    "input_file": {}
  },
  {
    "path": "posts/klinikopatolojik-calismalar-jamovi-modulleri/",
    "title": "Klinikopatolojik Çalışmalarda Kulanılabilecek Jamovi Modülleri",
    "description": "Klinikopatolojik çalışmalarda bu jamovi modülleri işinizi kolaylaştıracaktır.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2023-09-08",
    "categories": [
      "RStats",
      "GitHub",
      "template",
      "jamovi",
      "module",
      "shiny",
      "sunum",
      "istatistik"
    ],
    "contents": "\r\nKlinikopatolojik çalışmalarda bu jamovi modülleri işinizi kolaylaştıracaktır:\r\nhttps://www.jamovi.org/\r\nhttps://www.serdarbalci.com/ClinicoPathJamoviModule/\r\n\r\nBu Office tarafından sağlanan eklenmiş bir Microsoft Office belgesidir.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-09-14T10:20:17+03:00",
    "input_file": {}
  },
  {
    "path": "posts/gelecege-hazirlanan-cocuklar/",
    "title": "Geleceğe Hazırlanan Çocuklar",
    "description": "Yapay zeka çağına doğan çocuklar için.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2023-05-01",
    "categories": [],
    "contents": "\r\nSon aylarda gittikçe artan AI, yapay zeka, model bombardımanından çıkardığım sonuç şu ki;\r\nGeleceğe hazırlanan bir çocuk:\r\nBoolean (mantıksal) ifadeleri öğrenmeli.\r\nVE\r\nVEYA\r\nDEĞİL\r\nEŞİT\r\nEŞİT DEĞİL\r\n\r\nMatematik ve geometri ilişkisi öğrenmeli.\r\nTasvir yapabilmeli (prompt engineer dedikleri)\r\nBaşka bir dil öğrennmeli (farklı düşünebilmek için)\r\nHayal kurabilmeli.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-05-01T17:58:23+03:00",
    "input_file": {}
  },
  {
    "path": "posts/dijital-patoloji-akreditasyonu-ve-quarto-sunumu/",
    "title": "dijital patoloji akreditasyonu ve quarto sunumu",
    "description": "Makale saatinde dijital patoloji akreditasyonu ile ilgili sunum.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2023-04-08",
    "categories": [],
    "contents": "\r\nDijital patolojide akreditasyon ile ilgili bölümde yaptığım sunumu ve kodu paylaşıyorum. Bu sunumu Quarto ve reveal.js ile hazırladım. Herhangi bir kişiselleştirme yapmadan da güzel html sunum hazırlanabiliyormuş.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-04-08T15:25:50+03:00",
    "input_file": {}
  },
  {
    "path": "posts/molekuler-patoloji-hakkinda/",
    "title": "Moleküler Patoloji Hakkında",
    "description": "Moleküler Patoloji Hakkında / Moleküler Patolojiye Dair",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2022-10-10",
    "categories": [
      "patoloji",
      "moleküler patoloji",
      "patolojinin geleceği"
    ],
    "contents": "\r\nMoleküler Patoloji Hakkında / Moleküler Patolojiye Dair\r\n\r\nDOI 10.17605/OSF.IO/QZ7CJ\r\nhttps://doi.org/10.5281/zenodo.7175169\r\nMoleküler Patoloji nedir?\r\nMoleküler patoloji, anatomik patoloji, klinik patoloji ve genetiğin birlikte çalıştığı bir alandır. OMICS olarak belirtilen (genomik, proteomik, metabolomik gibi) yeni çalışma alanları ile de ilişkisi olan moleküler patoloji, günlük uygulamada daha çok kanser tanı ve mutasyon analizlerinde yer almaktadır.\r\nMoleküler patolojik incelemeler, patoloji spesmenlerindeki değişiklikleri moleküler düzeyinde inceleyen patoloji teknikleridir.\r\nMoleküler teknikler hangi amaçlarla kullanılır?\r\nMoleküler teknikler patolojide değişik amaçlarla kullanılmaktadır.\r\nTanı amaçlı:\r\nYetkin bir patoloji uzmanının morfolojik değerlendirmesi sonrası istenen uygun testler ile tümör ya da enfeksiyöz hastalıkların tanılarının konması ve tümör alt tiplerinin belirlenmesi amacıyla kullanılmaktadır. Birbirini tamamlar nitelikteki morfoloji ve moleküler incelemeler giderek onkolojik hastaların tanı, takip ve tedavisinde birbirinin ayrılmaz parçası haline gelmiştir. Öyle ki bazı tümörlerin isimleri moleküler teknikler ve morfolojilerin karşılaştırılması ile değiştirilmiş, yeni tanı grupları oluşturulmuştur.\r\nTedaviyi yönlendirme amaçlı:\r\nKanserli dokularda mutasyonun varlığı ya da yokluğu ile hedefe yönelik tedavilerin kullanımı mümkün olmaktadır. Bu mutasyonların varlığının ya da yokluğunun tespiti moleküler patolojide uygulanan testler ile yapılmaktadır.\r\nHastalığın seyrini (prognozunu) öngörme amaçlı:\r\nHer ne kadar hastalığın seyri kişisel nedenlere çok bağlı olsa da, hastaya uygun tedavi yönetimi için hastalığın olası seyrini bilmek gerekir. Bu nedenle kullanılan bazı moleküler teknikler onkoloji uzmanlarına yol göstermektedir.\r\nMoleküler teknikler nelerdir?\r\nMutasyon spesifik (mutasyona özgü) immünohistokimya:\r\nPatoloji pratiğinde günlük olarak kullanılan immünohistokimyasal çalışmalara benzeyen bu özellikli immünohistokimyalar, mutasyon ile ortaya çıkan protein yapılarının tespitine imkan vermektedir. Hızlı ve pratik olması nedeniyle (BRAF, IDH1 gibi) bazı mutasyonların tespitinde kullanılmaktadır.\r\nISH (in-situ hibridizasyon):\r\nHücrelerdeki DNA ya da RNA’lara bağlanan özel karşıt (komplementer) DNA ve RNA’lar kullanılarak yapılan testlerdir. Virüslerin tespitinde (EBER, HPV), tümör odağının tespitinde (karaciğerdeki albumin), kromozon değişikliklerinin tespitinde (1p19q kaybı, BCR-ABL füzyonu) ve gen ekspresyonlarının artışının tespitinde (HER2, EGFR) kullanılmaktadır.\r\nFlSH (Floresan in-situ hibridizasyon):\r\nÖzel floresan ışımalı kitler ve özel floresan mikroskobu kullanılarak yapılan in-situ hibridizasyon tetkiklerdir.\r\nCISH (Kromojen in-situ hibridizasyon):\r\nIn-situ hibridizasyonun ışık mikroskobu ile de yapılmasını sağlayan tetkiklerdir.\r\nPCR:\r\nPolimeraz zincir reaksiyonu (Polymerase Chain Reaction), dokudan elde edilen DNA ya da RNA’ların laboratuvarda çoğaltılması işlemidir. Belli sayıda çoğaltma süresinde eğer mutasyon varsa yeterli yeni DNA ya da RNA oluşmakta ve mutasyon varlığı tespit edilmektedir.\r\nMutasyon analizi:\r\nTümörlerde görülen mutasyonlar çok çeşitlidir. Kimi mutasyonlar tümörün çoğalmasında ana etkenken, kimileri sadece hasarlı olarak kalmakta ve tümörün davranışına (tümör biyolojisine) etki etmemektedir. Tümör davranışına etki eden bu “sürücü” (driver) mutasyonlar ile davranışa etki etmeyen “yolcu” (passenger) mutasyonlar tanı, tedavi ve sağkalım açısından farklıdırlar. Bu nedenle tümör davranışını direk belirleyebilecek seçili mutasyonlara özgü analizler (nokta mutasyon analizleri) moleküler patolojide kullanılmaktadır.\r\nSekanslama:\r\nBir DNA dizisindeki bazların teker teker okunması ile yapılan analizdir. Böylece oluşan mutasyonun hangi değişiklikle olduğu anlaşılır ve buna göre tanı, tedavi seçimi yapılır.\r\nYeni kuşak sekanslama:\r\nDNA’nın çok sayıda odağının aynı anda okunmasına dayanan yeni kuşak sekanslama ile bir tümörde olan tüm mutasyonlar tespit edilebilmektedir. Özellikle ileri evre ve ilk tedavilerini tamamlamış hastalarda ilgili tümörde sık görülmeyen ancak tedavi için ilacı bulunan mutasyonların tespitinde kullanılmaktadır.\r\nMutasyon yükü:\r\nDNA’da değişikliğe neden olan hasarlara mutasyon denmektedir. Mutasyonlar hemen her hücre bölünmesinde olmakta ve hemen tümü tamir edilmektedir. Kanser hücreleri çok hızlı büyüdüklerinden ve tamir mekanizmaları yeterli düzeltmeleri yapamadığından bu mutasyonlar birikmektedir. Bu mutasyonlu birikimin toplam DNA miktarına oranı ile elde edilen mutasyon ölçüm yükü yakın zamanda tedavi seçiminde kullanılmaya başlamıştır. Bir tümörde ne kadar çok mutasyon varsa (melanomlar gibi), o kadar çok yabancı antijen üretilecek ve bu tümörler immünmodülatör tedavilere (PD1-PDL1 ilişkili) daha iyi yanıt vereceklerdir.\r\nMoleküler tekniklerin birbirine üstünlüğü var mıdır?\r\nMoleküler çalışmalarda farklı teknikler farklı özgünlük ve duyarlılığa sahiptir. Bunun için hastaya ve planlanan tedaviye özgü testler seçilmelidir.\r\nMoleküler teknikler için dokular nasıl saklanmalıdır?\r\nMoleküler teknikler için dokular uygun tespit ve takip işlemleri yapılıp, patoloji laboratuvarlarında uygun arşivlerde saklanmalıdır.\r\nEğer başka bir laboratuvara parafin blok (mum blok) taşıyorsanız, bunları oda sıcaklığında (21-23 c) muhafaza etmeniz gerekir.\r\nTümörlü alanın patolojide seçilmesi ya da işaretlenmesi ne demektir?\r\nAmeliyat ve biyopsi ile alınan dokular tümüyle tümörden oluşmazlar. Normal doku, nekroza gitmiş ölü doku ya da tümör öncesi (adenom, in situ tümör gibi) alanlar da içerebilirler. Tümör içinde de alt gruplar oluşmakta ve kimi alt gruplar hastalığın asıl nedeni olup hızlıca büyürken, kimileri büyüme özelliğini yitirmiş olabilmektedir. Tümör patolojisinde yetkin bir patoloji uzmanı mikroskopla tümörün uygun alanını seçmeli ve seçtiği alandaki tümör hücre sayısını ya da yüzdesini belirtmelidir. Bu ön değerlendirmenin yapılmadığı durumlarda yanlış pozitif ya da yanlış negatif sonuçlar alınmakta, tedavi alabilecek hastalar tedavileri alamamakta, tedavi almasında fayda umulmayan hastalar ise gereksiz yere ilaca maruz kalmaktadır.\r\nMoleküler teknikler sadece tümörler için mi kullanılır?\r\nMoleküler patolojide genelde tümörler için kullanılsa da enfeksiyon hastalıkları ve kimlik tayini için de benzer teknikler uygulanabilmektedir.\r\nHer tümör için moleküler tetkik yapılmalı mıdır?\r\nKanser hastaları giderek daha uzun yaşamakta ve yıllar içinde yeni tedavi yöntemleri rutin uygulamaya girmektedir. Bu nedenle tümör dokusu hastalar için eskiye nazaran çok daha kıymetli olmaya başlamıştır. Potansiyel olarak her tümörde moleküler patoloji çalışmaları yapılabilir. Ancak bu durumda ileride kullanılabilecek dokunun muhafazasına dikkat edilmelidir. Eğer alınacak sonuç hastanın tedavisini yönlendirici nitelikte değilse (yani klinik endikasyon yoksa) ya da bu analiz etik kurul onaylı bilimsel bir çalışmanın parçası değilse moleküler çalışmalar yapılmamalıdır.\r\nMoleküler tekniklerin “akıllı ilaç” ya da “hedefe yönelik tedavi” için kullanımı\r\nHedefe yönelik tedaviye uygunluğun tespiti için moleküler patoloji teknikleri kullanılmaktadır. Hastalık ve mutasyona göre değişiklik göstermekle birlikte ilgili mutasyonların varlığı ya da yokluğunda kimi ilaçlar tedavide kullanılmaktadır. Bu analizler ilaçtan fayda sağlayabilecek hastaları belirlerken aynı zamanda ilacın fayda sağlamayacağı hastaları da tespit etmekte ve bu hastaları ilaçların olası yan etkilerinden korumaktadır.\r\nHer doku moleküler tekniklerle incelenebilir mi?\r\nUygun tespit ve takip ile parafine gömülmüş (mum blok yapılmış) dokular ve hızlı dondurma ile (-80 C) saklanan dokularda moleküler çalışmalar yapılabilir. Ameliyat ya da biyopsi ile alınan dokuların uygun tespiti (çok çabuk formaldehit solüsyonu içine alınması) bu nedenle çok önemlidir. Yeterli formaldehit ile tespit edilmeyen dokularda otoliz olacağından moleküler çalışmalar sağlıklı olmayacaktır.\r\nKaç yıl önceki bir tümöre moleküler patolojide inceleme yapılabilir?\r\nE\r\nğer uygun tespit ve takip işlemleri uygulanmışsa, uygun patoloji arşivlerinde saklanan dokulardan on yıllar sonra bile moleküler patoloji tektikleri yapılabilmektedir.\r\nMoleküler tetkik sonrası mutasyonun var ya da yok olması neyi gösterir? Negatif ya da pozitif sonuç ne demektir? Mutasyonun var olması kötü bir şey midir? Mutasyonun olmaması kötü bir şey midir?\r\nMoleküler patoloji raporları genelde detaylı teknik bilgiler içerir. Mutasyonun var olması ya da yok olması, kimi hastalıklarda tedaviye yanıt verme ihtimalini gösterirken, kimi hastalıklarda o tedavinin verilmemesi gerektiğini belirtebilir. Bu nedenle moleküler patoloji raporlarının hastayı takip eden onkoloji uzmanı hekim tarafından yorumlaması gerekmektedir.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-10-11T16:24:29+03:00",
    "input_file": {}
  },
  {
    "path": "posts/dijital-patoloji-hakkinda/",
    "title": "Dijital Patoloji Hakkında",
    "description": "Dijital Patoloji Hakkında / Dijital Patolojiye Dair",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2022-10-02",
    "categories": [
      "patoloji",
      "dijital patoloji",
      "patolojinin geleceği"
    ],
    "contents": "\r\n\r\nhttps://doi.org/10.5281/zenodo.7135447\r\nDOI: 10.17605/OSF.IO/9345U\r\nDijital Patoloji nedir?\r\nDijital patolojiyi patoloji incelemesinde kullanılan preparatların yüksek çözünürlükte taranarak bilgisayar ortamına aktarılması ve bu görüntülerin iletilme ve işlenme süreci olarak tanımlayabiliriz.\r\nDijital patoloji hangi alanlarda kullanılır?\r\nDijital patoloji ilk etapta araştırma ve eğitim amacıyla kullanılmaya başlanmış, daha sonra uzak merkezlerdeki uzman patologlara vaka danışmada (konsültasyon) ve frozenda (ameliyat sırasında hızlı tanı) yerini almıştır. Bir hastanın ilk tanısı için mikroskop yerine kullanımı yakın zamanda ABD ve Avrupa’da onaylandığından, şu an rutin işleyişte de yer almaktadır. Özellikle pandeminin getirdiği uzaktan çalışma zorunluluğu dijital patolojinin gelişmesi için hızlandırıcı bir etken olmuştur.\r\nDijital patoloji kullanımı ne kadar yaygındır?\r\nAslında ameliyatta alınan dokuların makroskopik görüntülerinin, endoskopik görüntülerin ve mikroskopla çekilen fotoğrafların işlenmesi üzerinde uzun zamandır devam eden morfometrik çalışmalar dijital patolojinin başlangıcı sayılabileceğinden, dijital patolojinin bilinen ve oldukça yaygın kullanım alanı olduğunu söyleyebiliriz. Ancak hasta tanısı için ilk etapta mikroskop yerine kullanımı henüz daha yeni olduğundan, bu amaçla kullanılan dijital patoloji daha çok büyük laboratuvar ve üniversite hastaneleri ile sınırlıdır.\r\nDijital patoloji hastalık tanısında kullanılır mı?\r\nDijital patoloji, hastalıkların tanısına yardımcı özelliklerin tespit edilmesinde yaygın olarak kullanılmaktadır. Karaciğer yağlanmasının ölçülmesi, tümör büyüklüğünün ve derinliğinin ölçülmesi, tümörün cerrahi sınırlara olan uzaklıklarının tespiti, tümör ile çevre dokunun ayrılması ve immünohistokimyasal belirteçlerin sayısal olarak doğru raporlanması gibi alanlarda geliştirilmiş yazılım ve karar destek sistemleri mevcuttur.\r\nSitolojik örneklerin patolog tarafından incelenmesinden önce ilk değerlendirmesini yapan yapay zeka algoritmaları klinik pratikte yer bulmaya başlamıştır. Prostat iğne biyopsilerinin ve meme biyopsilerinin de yapay zeka ile ön incelemeden geçirilmesi ve şüpheli alanların işaretlenmesi yakın zamanda rutin kullanım için onaylanmıştır. Google gibi büyük yazılım firmaları lenf düğümlerindeki küçük metastazların tespiti konusunda önemli çalışmalar yapmaktadırlar.\r\nKarar destek sistemleri nasıl geliştiriliyor?\r\nDaha önce tanı almış onbinlerce olgunun görüntüleri ve tanıları yapay zeka (artificial intelligence) ve makina öğrenmesi (machine learning) algoritmaları ile işlenmektedir. Bu şekilde ‘öğrenen’ algoritma yeni gelen olgunun tanısında ya da özelliklerinin tespitinde kullanılmaktadır.\r\nYapay zekanın, yani bir makinanın verdiği tanıya güvenebilir miyiz?\r\nDijital patolojiye ve genel olarak yapay zekaya yöneltilen en büyük eleştiri algoritmaların genelde ‘kapalı kutu’ (black box) şeklinde olmasıdır. Şüpheli bir alanın tespit edildiğinde bu alanın neden şüpheli olduğunu bu algoritmalar açıklayamamaktadır. Ancak bu durum insan beyni için de geçerlidir (araç kullanırken, ya da yemek yerken yaptığımız her hareketi açıklayamayışımız gibi).\r\nEksiklik gibi görünen bu durum aslında yeni tanı yöntemleri geliştirilmesine olanak tanımakta ve patologların kendilerini de geliştirmelerine katkı sağlamaktadır. Bu durumu Go ve satranç oyuncularının kendilerini yapay zeka ile geliştirmelerine benzetebiliriz.\r\nBenzer şekilde yapay zekanın yaptığı hatalar patologlar tarafından tespit edilmekte (kanama pigmenti ile immünohistokimyasal incelemelerin karıştırılması gibi) ve algoritmalar güçlendirilmektedir.\r\nAçıklanabilir yapay zeka konusunda da araştırma ve geliştirme çalışmaları çok hızlı bir şekilde devam etmektedir.\r\nDijital patoloji patologların yerini mi alacak?\r\nGeliştirilen her yeni teknolojide sorulan ilk sorulardan birisi de makinaların insanların yerini alacağı konusundaki endişelerdir. Bu konu spekülasyona açık olmakla birlikte uzmanların öngörüleri ‘dijital patolojiyi etkin kullanabilen patologların’ diğer patologların yerini alacağı ve dijital patolojinin rutin kullanıldığı ve geliştirildiği laboratuvarların diğer laboratuvarlara önderlik edeceği yönündedir.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-05-18T22:55:55+03:00",
    "input_file": {}
  },
  {
    "path": "posts/patolojinotlari/",
    "title": "Patoloji Notları",
    "description": "Sosyal medya paylaşımlarından derlenen bir patoloji kitabı.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2022-04-05",
    "categories": [
      "patoloji",
      "ders notları",
      "patolojinotlari",
      "R",
      "sosyal medya",
      "twitter"
    ],
    "contents": "\r\nSosyal meyada paylaşılan patoloji görüntüleri o kadar zengin ki, çoğu\r\ntextbook’tan daha açıklayıcı bilgiler içerebiliyor. Bunları yakından\r\ntakip etmek için bir dönem rtweet paketi ile günlük\r\nolarak twitter’ı tarayıp bunları web sayfası halinde düzenliyordum:\r\npathtweets\r\npathtweets\r\nİleride tidytags\r\npaketi ile bu projeye devam etmeye niyetim var.\r\nBu arada manuel olarak hazırladığım sayfa da güzel bir örnek oldu\r\ndiye düşünüyorum: Patoloji\r\nNotları\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-09-27T14:58:09+03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-24-apple-m1-r-paket-gfortran/",
    "title": "Apple M1 Chip bilgisayarda R paketleri için gfortran yükleme",
    "description": "Apple M1 Chip bilgisayarda R paketleri için gfortran yüklemek gerekiyor. Onun için bulabildiğim en kısa yol",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2021-10-24",
    "categories": [
      "RStats",
      "package",
      "gfortran",
      "mac",
      "apple",
      "M1"
    ],
    "contents": "\r\nR ile gfortranı M1 chipli bilgisayarda buluşturmaya çalıştım. Benim bulduğum kısayol şu oldu.\r\nBu R’da Hmisc paketini yüklerken aldığım hata mesajı:\r\nmake: /opt/R/arm64/bin/gfortran: Permission denied\r\nBu sorunu çözmek için:\r\nxcode yüklü olmalı\r\nxcode-select --install\r\n\r\nbrew ile gfortan’ı kurun\r\nbrew install gcc\r\n\r\nsonra R’ın gfortran’ı bulamıyorum dediği yere link koyun:\r\nsudo ln -s /opt/homebrew/bin/gfortran /opt/R/arm64/bin\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-09-27T14:58:09+03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-06-r-ile-topluca-dosya-ismi-degistirme/",
    "title": "R ile topluca dosya ismi değiştirme",
    "description": "Bir grup fotoğrafın ismini değiştirmemiz lazımdı. Bu küçük kodu onun için yazdım.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2021-09-06",
    "categories": [
      "RStats"
    ],
    "contents": "\r\nTatilde olsak da kod yazmaya devam:\r\nElimizde bir grup fotoğraf vardı. Karşısında da kimin fotoğrafı olduğu yazıyordu. Dosyaların isimlerini karşılarındakine göre değiştirmek için bu küçük kodu yazdım.\r\n\r\n\r\nbatch rename files #rstatshttps://t.co/AWUNd5OEiUCreated with @carbon_app pic.twitter.com/ffbnTNTdSo\r\n\r\n— Serdar Balcı (@serdarbalci) September 5, 2021\r\n\r\nBu da tatilden :)\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-09-27T14:58:09+03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-15-neden-jamovi-modullerine-ihtiyacim-oldu/",
    "title": "Neden jamovi modüllerine ihtiyacım oldu?",
    "description": "jamovi modülleri hakkında bir sunum hazırlıyorum. Orada da anlatacağım bazı kısımlara hazırlık için bu gönderiyi hazırladım.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2021-03-15",
    "categories": [
      "RStats",
      "GitHub",
      "template",
      "jamovi",
      "module",
      "shiny"
    ],
    "contents": "\r\nÇok merkezli ve çok uluslu yaptığımız çalışmalarımız patoloji, histopatoloji ve klinikopatolojik değerlendirmelere yönelik1. Tanımlayıcı istatistikler, gruplar arası karşılaştırmalar, gözlemciler arası uyum, ve sağkalım analizleri hemen her çalışmamızda kullandığımız teknikler. Yavaş yavaş veritabanları (SEER, TCGA), metin madenciliği ve görüntü analizine doğru ilerliyoruz.\r\nUzun zamandır bu çok merkezli ve çok uluslu çalışmalarda verileri derleyip toparlama ve analize hazırlama işini üstleniyorum. Bu çalışmalarda sık kullandığımız metodlar neredeyse standart olacak hale geldi.\r\nPatoloji dergilerinde yayınlanan çalışmalardaki istatistik yöntemlerini inceleyen araştırmalar 2 3 4 5 ve bir patoloji çalışmasında olması gereken minimum değişkenlerin tanımlaması 6 7 bu standardizasyonun genele de yaygınlaşacağını gösteriyor.\r\nFigure from Statistical Literacy Among Academic Pathologists: A Survey Study to Gauge Knowledge of Frequently Used Statistical Tests Among Trainees and FacultyFigure from Knijn N, Simmer F, Nagtegaal ID. Recommendations for reporting histopathology studies: a proposal. Virchows Arch. 2015 Jun;466(6):611-5. doi: 10.1007/s00428-015-1762-3. Epub 2015 Apr 7. PMID: 25846513; PMCID: PMC4460276.Figure from Guidelines for reporting histopathology studies Knijn N, Nagtegaal ID Correction Journal of Clinical Pathology 2015;68:173-174.İtiraf etmeli ki bu veri temizleme işi çok vakit alıcı ve bu işi otomatize etmek işimi kolaylaştırıyor. Sadece farklı ülkelerden gelen tarihleri standardize etmenin bile ne kadar önemli olduğunu anlatmama gerek var mı? Bir de son anda eklenen vakalar, verilerde olan güncellemeler, yeni sağkalım bilgileri … Analizlerin de sürekli yenilemesi ve güncellemesi gerekiyor.\r\nUzun süre point and click software kullandım. Nâm-ı diğer SPSS. Tam onun syntax’ını öğrenmek üzereydirm ki R-project8 ile tanıştım. Ama onda da kendimi rahat hissetmek epey vakit aldı. Arada R-Commander9 işimi kolaylaştırdıysa da, uzun bir süre internetten ve forumlardan kodlar derledim.10\r\nEn nihayetinde kendi workflow (iş akışı) kodlarımı hazırladım. Bu kodları bir şablon haline getirip GitHub’da kullanmaya başladım.11\r\nFigure from Histopathology Research TemplateDaha sonra beraber çalıştığım arkadaşlara da kolaylık olsun diye bu kodları shiny ile kullanmak istedim. 12 13 14 15\r\nShiny web üzerinden paylaşılabilse de bir masaüstü uygulaması şeklinde kullanabilme olanağı 16 17 18 19 20 21 22 23 24 25 26 çok hoşuma gitti27 ve electron ile bir küçük istatistik programı yazmaya başladım.28\r\nhttps://github.com/sbalci/clinicopathologicalBuradaki en büyük sorunum ise verileri sisteme aktarmak (import) oldu.\r\nBunda oldukça zorlanınca veriyi aktarma, programı kurma gibi sorunlar yerine analiz içeriğine ve R kodlarına odaklanmak için jamovi29 modülleri30 ile ilgilenmeye başladım.\r\nGeliştiriciler birkaç soruma sabırla cevap verdikten sonra31 32 33 beni slack grubuna aldılar ve modülleri geliştirmemde hep yardımcı oldular 34.\r\nİlk başta tek bir modül olarak tasarlasam da35 büyüklüğü nedeniyle36 bu modülü alt gruplara bölmek daha uygun oldu:\r\nTanımlayıcı İstatistikler için: ClinicoPathDescriptives37\r\nGGStatsPlot’u38 kullanmak için: jjstatsplot39\r\nSağkalım analizleri için: jsurvival40\r\nKarar analizleri için: meddecide41\r\nZaman içinde analizleri tablo olarak paylaşmanın da yeterli olmadığını farkettim. Günlük dille olmasa da makale diliyle bir açıklama yazmak gerekiyordu. Bu gibi özetleri yazan paketlerden de ilham alarak42, tablolardaki değerleri alıp özetleyen kodlar ekledim43.\r\nŞimdilerde ihtiyaç duydukça ve talepler oldukça44 modülleri güncelliyorum.\r\n\r\nhttps://scholar.google.com.tr/citations?user=q40DcqYAAAAJ&hl=en↩︎\r\n Hokanson JA, Ladoulis CT, Quinn FB Jr, Bienkowski AC. Statistical techniques reported in pathology journals during 1983-1985. Implications for pathology educators. Arch Pathol Lab Med. 1987 Feb;111(2):202-7. PMID: 3813838. ↩︎\r\n Statistical Literacy Among Academic Pathologists: A Survey Study to Gauge Knowledge of Frequently Used Statistical Tests Among Trainees and Faculty ↩︎\r\n Cuff, Justin MD; Higgins, John P.T. MD Statistical Analysis of Surgical Pathology Data Using the R Program, Advances In Anatomic Pathology: May 2012 - Volume 19 - Issue 3 - p 131-139 doi: 10.1097/PAP.0b013e318254d842 ↩︎\r\n Bahar B, Pambuccian SE, Barkan GA, Akdas Y. The Use and Misuse of Statistical Methods in Cytopathology Studies: Review of 6 Journals. Lab Med. 2019 Jan 1;50(1):8-15. doi: 10.1093/labmed/lmy036. PMID: 30020520. ↩︎\r\n Knijn N, Simmer F, Nagtegaal ID. Recommendations for reporting histopathology studies: a proposal. Virchows Arch. 2015 Jun;466(6):611-5. doi: 10.1007/s00428-015-1762-3. Epub 2015 Apr 7. PMID: 25846513; PMCID: PMC4460276. ↩︎\r\n Guidelines for reporting histopathology studies Knijn N, Nagtegaal ID Correction Journal of Clinical Pathology 2015;68:173-174. ↩︎\r\nhttps://www.r-project.org/↩︎\r\nhttps://socialsciences.mcmaster.ca/jfox/Misc/Rcmdr/↩︎\r\nhttps://github.com/sbalci/MyRCodesForDataAnalysis↩︎\r\nhttps://www.serdarbalci.com/histopathology-template/↩︎\r\nhttps://serdarbalci.shinyapps.io/histopathR/↩︎\r\nhttps://hub.docker.com/r/serdarbalci/clinicopathological↩︎\r\nhttps://twitter.com/serdarbalci/status/1197849208302252032↩︎\r\nhttps://mybinder.org/v2/gh/sbalci/histopathology-template/master?urlpath=rstudio↩︎\r\nhttps://www.travishinkelman.com/deploy-shiny-electron/↩︎\r\nhttps://github.com/dirkschumacher/r-shiny-electron/↩︎\r\nhttps://foretodata.com/how-to-make-a-standalone-desktop-application-with-shiny-and-electron-on-windows/↩︎\r\nhttps://chasemc.github.io/electricShine/↩︎\r\nhttps://www.r-bloggers.com/2014/04/deploying-desktop-apps-with-r/↩︎\r\nhttp://blog.analytixware.com/2014/03/packaging-your-shiny-app-as-windows.html↩︎\r\nhttps://github.com/ColumbusCollaboratory/electron-quick-start↩︎\r\nhttps://github.com/ColumbusCollaboratory/photon↩︎\r\nhttps://www.travishinkelman.com/deploy-shiny-electron/↩︎\r\nhttps://github.com/wleepang/DesktopDeployR↩︎\r\nhttps://www.youtube.com/watch?v=ARrbbviGvjc↩︎\r\nhttps://twitter.com/serdarbalci/status/1198348640294711296↩︎\r\nhttps://github.com/sbalci/clinicopathological↩︎\r\nhttps://www.jamovi.org/↩︎\r\nhttps://www.jamovi.org/library.html↩︎\r\nhttps://github.com/jamovi/jamovi/issues↩︎\r\nhttps://forum.jamovi.org/↩︎\r\nhttps://dev.jamovi.org/↩︎\r\nhttps://www.jamovi.org/about.html↩︎\r\nhttps://github.com/sbalci/ClinicoPathJamoviModule↩︎\r\nPaketlerdeki hazır kodları kullandığım için -ve R paketlerini kurarken tüm bağımlı paketleri de kurmak zorunda olduğumuz için- modüller epey büyük boyutta.↩︎\r\nhttps://github.com/sbalci/ClinicoPathDescriptives/↩︎\r\nhttps://indrajeetpatil.github.io/ggstatsplot/↩︎\r\nhttps://github.com/sbalci/jjstatsplot↩︎\r\nhttps://github.com/sbalci/jsurvival↩︎\r\nhttps://github.com/sbalci/meddecide/↩︎\r\nhttps://github.com/easystats/report/↩︎\r\nhttps://github.com/sbalci/ClinicoPathJamoviModule/blob/master/R/summarydata.b.R#L103↩︎\r\nhttps://github.com/sbalci/ClinicoPathJamoviModule/issues↩︎\r\n",
    "preview": {},
    "last_modified": "2022-09-27T14:58:09+03:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-11-02-github-repository-collections/",
    "title": "GitHub Repository Collections",
    "description": "I use Organizations to collect GitHub Repositories.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2020-11-02",
    "categories": [
      "RStats",
      "GitHub",
      "Collection"
    ],
    "contents": "\r\nUpdate on 9 July 2022:\r\nNow GitHub has star collections, and it is easier:\r\nhttps://github.com/sbalci?tab=stars\r\nI use GitHub’s\r\norganizations as a means to collect repositories. Please let me know\r\nif you have recommendations to add.\r\nCurrently these are my organizations:\r\nOrganization\r\nContent\r\nClinicoPath\r\nRepositories used for ClinicoPath jamovi module\r\nPBPath\r\nPancreatobiliary Pathology Society\r\nPathologyWeb\r\nInformation Technologies for the Practice of Pathology\r\nbibliometrics\r\nCollection of Repositories Related to Bibliometrics, Bibliography,\r\nKnowledge Extraction and Text Mining\r\nbiostatistical\r\nBiostatistics Repositories\r\ndataeducation\r\nCollection of Data Analysis Education Repositories\r\ngenomicanalysis\r\nGene Analysis\r\nhistopathology\r\nCollection of Repositories related to Histopathology and Image\r\nAnalysis\r\njournalwatch\r\nRepositories for Pathology Journal Watch\r\nknowledgeextraction\r\nKnowledge Discovery and Extraction from Text Data and Social\r\nMedia\r\nseeranalysis\r\nRepositories and Codes for SEER Analysis\r\nstatisticial-modelling-center\r\nModel İstatistik Merkezi (Statistical Modelling Center)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-09-27T14:58:09+03:00",
    "input_file": {}
  }
]
