[
  {
    "path": "posts/2021-03-15-neden-jamovi-modullerine-ihtiyacim-oldu/",
    "title": "Neden jamovi modüllerine ihtiyacım oldu?",
    "description": "jamovi modülleri hakkında bir sunum hazırlıyorum. Orada da anlatacağım bazı kısımlara hazırlık için bu gönderiyi hazırladım.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2021-03-15",
    "categories": [
      "RStats",
      "GitHub",
      "template",
      "jamovi",
      "module",
      "shiny"
    ],
    "contents": "\nÇok merkezli ve çok uluslu yaptığımız çalışmalarımız patoloji, histopatoloji ve klinikopatolojik değerlendirmelere yönelik1. Tanımlayıcı istatistikler, gruplar arası karşılaştırmalar, gözlemciler arası uyum, ve sağkalım analizleri hemen her çalışmamızda kullandığımız teknikler. Yavaş yavaş veritabanları (SEER, TCGA), metin madenciliği ve görüntü analizine doğru ilerliyoruz.\nUzun zamandır bu çok merkezli ve çok uluslu çalışmalarda verileri derleyip toparlama ve analize hazırlama işini üstleniyorum. Bu çalışmalarda sık kullandığımız metodlar neredeyse standart olacak hale geldi.\nPatoloji dergilerinde yayınlanan çalışmalardaki istatistik yöntemlerini inceleyen araştırmalar 2 3 4 5 ve bir patoloji çalışmasında olması gereken minimum değişkenlerin tanımlaması 6 7 bu standardizasyonun genele de yaygınlaşacağını gösteriyor.\nFigure from Statistical Literacy Among Academic Pathologists: A Survey Study to Gauge Knowledge of Frequently Used Statistical Tests Among Trainees and FacultyFigure from Knijn N, Simmer F, Nagtegaal ID. Recommendations for reporting histopathology studies: a proposal. Virchows Arch. 2015 Jun;466(6):611-5. doi: 10.1007/s00428-015-1762-3. Epub 2015 Apr 7. PMID: 25846513; PMCID: PMC4460276.Figure from Guidelines for reporting histopathology studies Knijn N, Nagtegaal ID Correction Journal of Clinical Pathology 2015;68:173-174.İtiraf etmeli ki bu veri temizleme işi çok vakit alıcı ve bu işi otomatize etmek işimi kolaylaştırıyor. Sadece farklı ülkelerden gelen tarihleri standardize etmenin bile ne kadar önemli olduğunu anlatmama gerek var mı? Bir de son anda eklenen vakalar, verilerde olan güncellemeler, yeni sağkalım bilgileri … Analizlerin de sürekli yenilemesi ve güncellemesi gerekiyor.\nUzun süre point and click software kullandım. Nâm-ı diğer SPSS. Tam onun syntax’ını öğrenmek üzereydirm ki R-project8 ile tanıştım. Ama onda da kendimi rahat hissetmek epey vakit aldı. Arada R-Commander9 işimi kolaylaştırdıysa da, uzun bir süre internetten ve forumlardan kodlar derledim.10\nEn nihayetinde kendi workflow (iş akışı) kodlarımı hazırladım. Bu kodları bir şablon haline getirip GitHub’da kullanmaya başladım.11\nFigure from Histopathology Research TemplateDaha sonra beraber çalıştığım arkadaşlara da kolaylık olsun diye bu kodları shiny ile kullanmak istedim. 12 13 14 15\nShiny web üzerinden paylaşılabilse de bir masaüstü uygulaması şeklinde kullanabilme olanağı 16 17 18 19 20 21 22 23 24 25 26 çok hoşuma gitti27 ve electron ile bir küçük istatistik programı yazmaya başladım.28\nhttps://github.com/sbalci/clinicopathologicalBuradaki en büyük sorunum ise verileri sisteme aktarmak (import) oldu.\nBunda oldukça zorlanınca veriyi aktarma, programı kurma gibi sorunlar yerine analiz içeriğine ve R kodlarına odaklanmak için jamovi29 modülleri30 ile ilgilenmeye başladım.\nGeliştiriciler birkaç soruma sabırla cevap verdikten sonra31 32 33 beni slack grubuna aldılar ve modülleri geliştirmemde hep yardımcı oldular 34.\nİlk başta tek bir modül olarak tasarlasam da35 büyüklüğü nedeniyle36 bu modülü alt gruplara bölmek daha uygun oldu:\nTanımlayıcı İstatistikler için: ClinicoPathDescriptives37\nGGStatsPlot’u38 kullanmak için: jjstatsplot39\nSağkalım analizleri için: jsurvival40\nKarar analizleri için: meddecide41\nZaman içinde analizleri tablo olarak paylaşmanın da yeterli olmadığını farkettim. Günlük dille olmasa da makale diliyle bir açıklama yazmak gerekiyordu. Bu gibi özetleri yazan paketlerden de ilham alarak42, tablolardaki değerleri alıp özetleyen kodlar ekledim43.\nŞimdilerde ihtiyaç duydukça ve talepler oldukça44 modülleri güncelliyorum.\n\nhttps://scholar.google.com.tr/citations?user=q40DcqYAAAAJ&hl=en↩︎\n Hokanson JA, Ladoulis CT, Quinn FB Jr, Bienkowski AC. Statistical techniques reported in pathology journals during 1983-1985. Implications for pathology educators. Arch Pathol Lab Med. 1987 Feb;111(2):202-7. PMID: 3813838. ↩︎\n Statistical Literacy Among Academic Pathologists: A Survey Study to Gauge Knowledge of Frequently Used Statistical Tests Among Trainees and Faculty ↩︎\n Cuff, Justin MD; Higgins, John P.T. MD Statistical Analysis of Surgical Pathology Data Using the R Program, Advances In Anatomic Pathology: May 2012 - Volume 19 - Issue 3 - p 131-139 doi: 10.1097/PAP.0b013e318254d842 ↩︎\n Bahar B, Pambuccian SE, Barkan GA, Akdas Y. The Use and Misuse of Statistical Methods in Cytopathology Studies: Review of 6 Journals. Lab Med. 2019 Jan 1;50(1):8-15. doi: 10.1093/labmed/lmy036. PMID: 30020520. ↩︎\n Knijn N, Simmer F, Nagtegaal ID. Recommendations for reporting histopathology studies: a proposal. Virchows Arch. 2015 Jun;466(6):611-5. doi: 10.1007/s00428-015-1762-3. Epub 2015 Apr 7. PMID: 25846513; PMCID: PMC4460276. ↩︎\n Guidelines for reporting histopathology studies Knijn N, Nagtegaal ID Correction Journal of Clinical Pathology 2015;68:173-174. ↩︎\nhttps://www.r-project.org/↩︎\nhttps://socialsciences.mcmaster.ca/jfox/Misc/Rcmdr/↩︎\nhttps://github.com/sbalci/MyRCodesForDataAnalysis↩︎\nhttps://www.serdarbalci.com/histopathology-template/↩︎\nhttps://serdarbalci.shinyapps.io/histopathR/↩︎\nhttps://hub.docker.com/r/serdarbalci/clinicopathological↩︎\nhttps://twitter.com/serdarbalci/status/1197849208302252032↩︎\nhttps://mybinder.org/v2/gh/sbalci/histopathology-template/master?urlpath=rstudio↩︎\nhttps://www.travishinkelman.com/deploy-shiny-electron/↩︎\nhttps://github.com/dirkschumacher/r-shiny-electron/↩︎\nhttps://foretodata.com/how-to-make-a-standalone-desktop-application-with-shiny-and-electron-on-windows/↩︎\nhttps://chasemc.github.io/electricShine/↩︎\nhttps://www.r-bloggers.com/2014/04/deploying-desktop-apps-with-r/↩︎\nhttp://blog.analytixware.com/2014/03/packaging-your-shiny-app-as-windows.html↩︎\nhttps://github.com/ColumbusCollaboratory/electron-quick-start↩︎\nhttps://github.com/ColumbusCollaboratory/photon↩︎\nhttps://www.travishinkelman.com/deploy-shiny-electron/↩︎\nhttps://github.com/wleepang/DesktopDeployR↩︎\nhttps://www.youtube.com/watch?v=ARrbbviGvjc↩︎\nhttps://twitter.com/serdarbalci/status/1198348640294711296↩︎\nhttps://github.com/sbalci/clinicopathological↩︎\nhttps://www.jamovi.org/↩︎\nhttps://www.jamovi.org/library.html↩︎\nhttps://github.com/jamovi/jamovi/issues↩︎\nhttps://forum.jamovi.org/↩︎\nhttps://dev.jamovi.org/↩︎\nhttps://www.jamovi.org/about.html↩︎\nhttps://github.com/sbalci/ClinicoPathJamoviModule↩︎\nPaketlerdeki hazır kodları kullandığım için -ve R paketlerini kurarken tüm bağımlı paketleri de kurmak zorunda olduğumuz için- modüller epey büyük boyutta.↩︎\nhttps://github.com/sbalci/ClinicoPathDescriptives/↩︎\nhttps://indrajeetpatil.github.io/ggstatsplot/↩︎\nhttps://github.com/sbalci/jjstatsplot↩︎\nhttps://github.com/sbalci/jsurvival↩︎\nhttps://github.com/sbalci/meddecide/↩︎\nhttps://github.com/easystats/report/↩︎\nhttps://github.com/sbalci/ClinicoPathJamoviModule/blob/master/R/summarydata.b.R#L103↩︎\nhttps://github.com/sbalci/ClinicoPathJamoviModule/issues↩︎\n",
    "preview": {},
    "last_modified": "2021-07-24T14:44:04+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-11-02-github-repository-collections/",
    "title": "GitHub Repository Collections",
    "description": "I use Organizations to collect GitHub Repositories.",
    "author": [
      {
        "name": "Serdar Balci",
        "url": "https://github.com/sbalci"
      }
    ],
    "date": "2020-11-02",
    "categories": [
      "RStats",
      "GitHub",
      "Collection"
    ],
    "contents": "\nI use GitHub’s organizations as a means to collect repositories. Please let me know if you have recommendations to add.\nCurrently these are my organizations:\nOrganization\nContent\nClinicoPath\nRepositories used for ClinicoPath jamovi module\nPBPath\nPancreatobiliary Pathology Society\nPathologyWeb\nInformation Technologies for the Practice of Pathology\nbibliometrics\nCollection of Repositories Related to Bibliometrics, Bibliography, Knowledge Extraction and Text Mining\nbiostatistical\nBiostatistics Repositories\ndataeducation\nCollection of Data Analysis Education Repositories\ngenomicanalysis\nGene Analysis\nhistopathology\nCollection of Repositories related to Histopathology and Image Analysis\njournalwatch\nRepositories for Pathology Journal Watch\nknowledgeextraction\nKnowledge Discovery and Extraction from Text Data and Social Media\nseeranalysis\nRepositories and Codes for SEER Analysis\nstatisticial-modelling-center\nModel İstatistik Merkezi (Statistical Modelling Center)\n\n\n\n",
    "preview": {},
    "last_modified": "2021-07-24T14:44:04+00:00",
    "input_file": {}
  }
]
