<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">@import url('https://themes.googleusercontent.com/fonts/css?kit=OPeqXG-QxW3ZD8BtmPikfA');ul.lst-kix_h94nde2svjvq-6{list-style-type:none}ul.lst-kix_h94nde2svjvq-5{list-style-type:none}.lst-kix_o82qaovqd9jv-1>li:before{content:"-  "}.lst-kix_o82qaovqd9jv-2>li:before{content:"-  "}ul.lst-kix_h94nde2svjvq-8{list-style-type:none}ul.lst-kix_h94nde2svjvq-7{list-style-type:none}ul.lst-kix_o82qaovqd9jv-7{list-style-type:none}ul.lst-kix_o82qaovqd9jv-8{list-style-type:none}ul.lst-kix_o82qaovqd9jv-5{list-style-type:none}.lst-kix_o82qaovqd9jv-5>li:before{content:"-  "}ul.lst-kix_o82qaovqd9jv-6{list-style-type:none}ul.lst-kix_o82qaovqd9jv-3{list-style-type:none}ul.lst-kix_o82qaovqd9jv-4{list-style-type:none}ul.lst-kix_o82qaovqd9jv-1{list-style-type:none}ul.lst-kix_o82qaovqd9jv-2{list-style-type:none}.lst-kix_o82qaovqd9jv-3>li:before{content:"-  "}.lst-kix_o82qaovqd9jv-4>li:before{content:"-  "}ul.lst-kix_o82qaovqd9jv-0{list-style-type:none}.lst-kix_h94nde2svjvq-6>li:before{content:"-  "}.lst-kix_h94nde2svjvq-8>li:before{content:"-  "}.lst-kix_h94nde2svjvq-7>li:before{content:"-  "}.lst-kix_o82qaovqd9jv-6>li:before{content:"-  "}.lst-kix_o82qaovqd9jv-7>li:before{content:"-  "}.lst-kix_o82qaovqd9jv-8>li:before{content:"-  "}.lst-kix_h94nde2svjvq-0>li:before{content:"-  "}.lst-kix_h94nde2svjvq-4>li:before{content:"-  "}li.li-bullet-0:before{margin-left:-18pt;white-space:nowrap;display:inline-block;min-width:18pt}.lst-kix_h94nde2svjvq-5>li:before{content:"-  "}.lst-kix_h94nde2svjvq-3>li:before{content:"-  "}ul.lst-kix_h94nde2svjvq-0{list-style-type:none}.lst-kix_h94nde2svjvq-2>li:before{content:"-  "}ul.lst-kix_h94nde2svjvq-2{list-style-type:none}ul.lst-kix_h94nde2svjvq-1{list-style-type:none}.lst-kix_o82qaovqd9jv-0>li:before{content:"-  "}ul.lst-kix_h94nde2svjvq-4{list-style-type:none}.lst-kix_h94nde2svjvq-1>li:before{content:"-  "}ul.lst-kix_h94nde2svjvq-3{list-style-type:none}ol{margin:0;padding:0}table td,table th{padding:0}.c41{border-right-style:solid;border-top-width:0pt;border-right-width:0pt;border-left-width:0pt;border-top-style:solid;border-left-style:solid;border-bottom-width:0pt;border-bottom-style:solid;padding-right:0pt}.c10{background-color:#ffffff;padding-top:0pt;padding-bottom:0pt;line-height:1.2;orphans:2;widows:2;text-align:left;height:11pt}.c4{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Arial";font-style:normal}.c28{background-color:#ffffff;padding-top:0pt;padding-bottom:0pt;line-height:1.2;orphans:2;widows:2;text-align:left}.c34{padding-top:14pt;padding-bottom:4pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.c9{padding-top:16pt;padding-bottom:4pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.c13{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:16pt;font-family:"Arial";font-style:normal}.c16{color:#666666;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Arial";font-style:normal}.c36{color:#666666;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c21{padding-top:18pt;padding-bottom:6pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.c11{padding-top:0pt;text-indent:36pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c0{padding-top:16pt;padding-bottom:4pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:justify}.c14{padding-top:14pt;padding-bottom:4pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:justify}.c44{color:#333333;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c22{padding-top:12pt;padding-bottom:4pt;line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:justify}.c5{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c2{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c6{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify;height:11pt}.c1{padding-top:0pt;text-indent:36pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c26{color:#434343;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:14pt;font-family:"Arial";font-style:normal}.c24{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c12{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c31{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c45{color:#434343;font-weight:400;text-decoration:none;vertical-align:baseline;font-family:"Arial";font-style:normal}.c33{font-family:"Roboto";font-style:italic;color:#222222;font-weight:400}.c19{font-family:"Roboto";font-style:italic;color:#333333;font-weight:400}.c7{padding-top:0pt;padding-bottom:0pt;line-height:1.0;text-align:left}.c35{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;color:#0000ee;text-decoration:underline}.c42{background-color:#ffffff;text-decoration:none;vertical-align:baseline;font-style:normal}.c8{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;color:#1155cc;text-decoration:underline}.c39{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;text-decoration:underline}.c23{font-family:"Roboto";color:#333333;font-weight:400}.c43{background-color:#ffffff;max-width:468pt;padding:72pt 72pt 72pt 72pt}.c38{font-family:"Roboto";color:#222222;font-weight:400}.c15{font-weight:700;font-style:italic}.c27{margin-left:72pt;padding-left:0pt}.c18{margin-left:36pt;padding-left:0pt}.c3{color:inherit;text-decoration:inherit}.c25{padding:0;margin:0}.c20{font-size:12pt}.c37{color:#0952ab}.c17{text-indent:36pt}.c29{height:11pt}.c40{font-style:italic}.c30{color:#1a1a1a}.c32{height:12pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c43"><h2 class="c21" id="h.awc8eb1l8ncb"><span class="c13">Patolojide Bili&#351;imin yeri nedir?</span></h2><p class="c11"><span class="c2">Patologlar&#305;, hastan&#305;n klinik bilgilerini, makroskopi ve mikroskopik g&ouml;r&uuml;nt&uuml;ler ile i&#351;leyip, literat&uuml;r ve bilimsel bilgiler &#305;&#351;&#305;&#287;&#305;nda yorumlayan ve rapor adl&#305; yaz&#305;l&#305; bilgiyi &uuml;reten bilgi uzmanlar&#305; olarak tan&#305;mlayabiliriz. Abart&#305;l&#305; bir tarif gibi g&ouml;r&uuml;nse de &ccedil;o&#287;u hasta dosyas&#305;nda, hasta hakk&#305;nda en &ccedil;ok ve en do&#287;ru (hatta hala daha alt&#305;n standart) bilgiler patologlar&#305;n &uuml;retti&#287;i patoloji raporlar&#305;nda yer almaktad&#305;r.</span></p><p class="c11"><span class="c2">Bilginin teknoloji kullan&#305;larak i&#351;lenmesindeki geli&#351;meleri, patoloji disiplini, bazen geriden bazen &ouml;nc&uuml; olarak, ama emin ad&#305;mlarla takip etmekte ve kendi i&#351;leyi&#351;ine katmaktad&#305;r.</span></p><p class="c11"><span class="c2">Bilimsel bilginin s&uuml;rekli artmas&#305;, hemen her y&#305;l yeni bir DS&Ouml; s&#305;n&#305;flama kitab&#305;n&#305;n &ccedil;&#305;kmas&#305;, yeni &ccedil;&#305;kan antikorlar&#305;n ve y&ouml;ntemlerin tan&#305;sal test olarak kullan&#305;m&#305;ndaki istatistiksel y&ouml;ntemler, t&uuml;m&ouml;rlerin taksonomisi, &ldquo;ben buna displazi derim&rdquo; gibi sezgisel yakla&#351;&#305;mlar, klinik bilgilerin elde edilmesi, makroskopik ve mikroskopik g&ouml;r&uuml;nt&uuml;lerin elde edilmesi, i&#351;lenmesi ve saklanmas&#305;, rapor yaz&#305;lmas&#305;, diktasyon, raporlar&#305;n saklanmas&#305;, ar&#351;ivleme, laboratuvar i&#351; ak&#305;&#351;&#305;n&#305;n d&uuml;zenlenmesi ve takibi gibi bir &ccedil;ok basamakta yer alan bili&#351;im teknolojileri, dijital patolojinin yayg&#305;nla&#351;mas&#305; ile makina &ouml;&#287;renmesi, derin &ouml;&#287;renme ve yapay zeka ile karar destek sistemleri olarak g&uuml;nl&uuml;k prati&#287;e daha da girmektedir.</span></p><p class="c11"><span class="c2">Patoloji raporlar&#305; ve g&ouml;r&uuml;nt&uuml;leri i&ccedil;in kullan&#305;lan yaz&#305;l&#305;mlar (Rosai 1. chapter)&rsquo;da belirtildi&#287;i gibi &ccedil;o&#287;u zaman di&#287;er laboratuvar bran&#351;lar&#305; ya da radyoloj i&ccedil;in haz&#305;rlanm&#305;&#351; platformlara eklemlenmi&#351; gibidirler. Patolojinin i&#351;leyi&#351;i ile &ccedil;o&#287;u zaman &ouml;rt&uuml;&#351;meyen yaz&#305;l&#305;mlar, &ccedil;o&#287;u zaman bir metin i&#351;lemcisi ve faturaland&#305;rma arac&#305; olarak kalmaktad&#305;rlar.</span></p><h3 class="c9" id="h.u2448ue1zxqk"><span class="c26">Patolojideki bilgi t&uuml;rleri nelerdir?</span></h3><p class="c11"><span>Patolojide bilgi t&uuml;rleri temel olarak laboratuvar i&#351; ak&#305;&#351;&#305;, metin ve g&ouml;r&uuml;nt&uuml;lerden olu&#351;maktad&#305;r.</span></p><h4 class="c34" id="h.5r6koe6fd389"><span class="c16">Laboratuvar i&#351; ak&#305;&#351;&#305;: </span></h4><p class="c11"><span class="c2">Bir laboratuvar bran&#351;&#305; olarak patolojideki i&#351; ak&#305;&#351;&#305; &ccedil;o&#287;u zaman hastane y&ouml;neticilerinin ve hekimlerin de bilmedi&#287;i karma&#351;&#305;k basamaklardan olu&#351;maktad&#305;r. Bu basamaklar&#305;n her biri kendine has kalite kontrol &ouml;geleri ve veriler i&ccedil;ermektedir.</span></p><p class="c11"><span>Her ne kadar laboratuvar bran&#351;&#305; olarak g&ouml;r&uuml;lse de, patoloji sadece klinikten gelen isteklerin yap&#305;ld&#305;&#287;&#305; bir laboratuvar de&#287;ildir. Patologlar gelen spesmene bir hasta gibi yakla&#351;&#305;p her spesmene &ouml;zg&uuml; ayr&#305; &ouml;rnekleme ve de&#287;erlendirme yapmaktad&#305;r. Patolojinin ayr&#305; bir klinik olarak tan&#305;mlanmamas&#305;, patolo&#287;un tetkik isteyen bir hekim olarak kurgulanmam&#305;&#351; olmas&#305; nedeniyle hem rutin i&#351;leyi&#351;te hem de fatura ve performans de&#287;erlendirmelerinde sorunlar ortaya &ccedil;&#305;kmaktad&#305;r.</span></p><p class="c6"><span class="c4"></span></p><p class="c24"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 522.80px; height: 777.50px;"><img alt="" src="images/image7.png" style="width: 522.80px; height: 777.50px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c24"><span class="c4">Resim 1: Patoloji i&#351; ak&#305;&#351;&#305;</span></p><p class="c6"><span class="c4"></span></p><hr style="page-break-before:always;display:none;"><p class="c6"><span class="c4"></span></p><p class="c6"><span class="c4"></span></p><h4 class="c14" id="h.2h6dim3863x"><span class="c16">Metin Bilgileri</span></h4><p class="c1"><span class="c4">Patolojideki metin bilgilerini, patolo&#287;a klinikten ve literat&uuml;rden gelen bilgiler ile patolo&#287;un &uuml;retti&#287;i raporlar olu&#351;turmaktad&#305;r. Bu bilgilerin d&uuml;zg&uuml;n, eksiksiz ve anla&#351;&#305;l&#305;r olmas&#305; beklenmektedir. Literat&uuml;rdeki bilgi yo&#287;unlu&#287;unun kald&#305;r&#305;lamaz halde oldu&#287;u ve her antikorun ilk &ccedil;&#305;kt&#305;&#287;&#305;nda olduk&ccedil;a &ouml;zg&uuml;n ama &ccedil;al&#305;&#351;malar sonunda y&#305;llar i&ccedil;inde kullan&#305;lamaz hale geldi&#287;i g&uuml;n&uuml;m&uuml;zde &ldquo;bilgi ve internet okuryazarl&#305;&#287;&#305;&rdquo; &nbsp;patologlar i&ccedil;in vazge&ccedil;ilmez &ouml;neme sahiptir. Hangi literat&uuml;r&uuml;n, nas&#305;l kritik edilerek okunaca&#287;&#305;, bilgilerin hasta tan&#305;s&#305;nda nas&#305;l kullan&#305;laca&#287;&#305; konusunda da donan&#305;ml&#305; olmak gerekmektedir.</span></p><p class="c1"><span class="c4">Klinik bilgilerin d&uuml;zg&uuml;n ve eksiksiz aktar&#305;lmas&#305; i&ccedil;in hastane bilgi y&ouml;netim sistemlerine patologlar&#305;n &ldquo;tedaviyi veren hekim&rdquo; yetkisi ile ula&#351;mas&#305;n&#305;n sa&#287;lanmas&#305;, tan&#305; h&#305;z&#305;n&#305; ve do&#287;rulu&#287;unu artt&#305;racakt&#305;r.</span></p><p class="c1"><span class="c4">Patologlar genelde raporlar&#305;n&#305; hastalar&#305;n tedavisinden sorumlu olan klinisyenleri hedefleyerek yazsalar da, g&uuml;n&uuml;m&uuml;zde kendi bilgilerini irdelemek isteyen hastalar yan&#305; s&#305;ra raporlar&#305;n&#305; otomatik olarak kategorize etmek isteyen kay&#305;t sistemlerini de dikkate almak gerekmektedir.</span></p><p class="c1"><span class="c4">Hastalar&#305;n raporlardaki detaylarla u&#287;ra&#351;mas&#305;n&#305; engellemek ve onlar&#305; do&#287;ru y&ouml;nlendirmek i&ccedil;in CAP ve ADASP gibi organizasyonlar hastalar i&ccedil;in rehberler haz&#305;rlamaktad&#305;rlar. Hastalar&#305;n ve sigorta &#351;irketlerinin patoloji raporlar&#305;na yakla&#351;&#305;mlar&#305; nedeniyle ortaya &ccedil;&#305;kan sosyal sorunlar&#305; bertaraf etmek i&ccedil;in t&uuml;m&ouml;r isimlendirmelerinde yak&#305;n zamanda yap&#305;lan de&#287;i&#351;iklikler (tiroid ve prostat t&uuml;m&ouml;rlerindeki gibi) bu konunun ileride daha da &ouml;nemli olaca&#287;&#305;n&#305; ve belki de hastalar i&ccedil;in ayr&#305; rapor k&#305;s&#305;mlar&#305; d&uuml;zenlememiz gerektirece&#287;ini d&uuml;&#351;&uuml;nd&uuml;rmektedir.</span></p><p class="c1"><span class="c4">Raporlar&#305;n eksiksiz olmas&#305; ve ba&#351;ka kurumlardaki hekimler taraf&#305;ndan da anla&#351;&#305;lmas&#305;n&#305; sa&#287;lamak i&ccedil;in sinoptik (&#351;ablon) rapor kullan&#305;lmas&#305; gerekmektedir. Her ne kadar kimi patologlar kendi &uuml;sluplar&#305; ile tarif ve a&ccedil;&#305;klama yazmak isteseler de, her sat&#305;rda bir &ouml;zelli&#287;in oldu&#287;u ve gerekli t&uuml;m &ouml;zelliklerin a&ccedil;&#305;k&ccedil;a yaz&#305;ld&#305;&#287;&#305; sinoptik raporlama hasta y&ouml;netimi i&ccedil;in art&#305;k vazge&ccedil;ilmez bir gereklilik halindedir. Raporlar&#305;n bilgisayar arac&#305;l&#305;&#287;&#305;yla formlar kullan&#305;larak yaz&#305;ld&#305;&#287;&#305; ve her &ouml;zelli&#287;in veritaban&#305;nda ayr&#305; olarak kaydedildi&#287;i yap&#305;land&#305;r&#305;lm&#305;&#351; (structured) raporlar&#305;n ise ideal olarak her laboratuvarda olmas&#305; gerekmektedir. Yap&#305;land&#305;r&#305;lm&#305;&#351; rapor kullan&#305;lan sistemlerde hem kalite i&ccedil;in izleme ve de&#287;erlendirme h&#305;zl&#305;ca ve otomatik olarak yap&#305;labilmekte, hem de bilimsel ara&#351;t&#305;rmalar i&ccedil;in gerekli bilgilere kolayca ula&#351;mak m&uuml;mk&uuml;n olabilmektedir. Yap&#305;land&#305;r&#305;lm&#305;&#351; rapor kullanan sistemlerde raporun ilk onayland&#305;&#287;&#305; halinin de&#287;i&#351;tirilemez bir &lsquo;pdf&rsquo; d&ouml;k&uuml;man&#305; halinde kaydedilmesi (ve tercihan elektronik imza ile e&#351;le&#351;tirilmesi) gerekmektedir. Aksi takdirde rapor her a&ccedil;&#305;ld&#305;&#287;&#305;nda veritaban&#305;ndan gelen verilerle yeniden olu&#351;turuldu&#287;unda zaman i&ccedil;inde olu&#351;an &#351;ekilsel de&#287;i&#351;iklikler ilk raporla farkl&#305;l&#305;klar olu&#351;mas&#305;na neden olmaktad&#305;r. Bu durum medikolegal sorunlara neden olabilmektedir.</span></p><p class="c1"><span class="c4">Patoloji raporlar&#305;n&#305;n metin madencili&#287;i y&ouml;ntemleri kullan&#305;larak s&#305;n&#305;fland&#305;r&#305;lmas&#305; konusunda &ouml;neriler ve &ccedil;al&#305;&#351;malar mevcuttur. Ancak bu y&ouml;ntemlerin ba&#351;ar&#305;l&#305; olabilmesi i&ccedil;in standart yaz&#305;ma ve daktilo hatalar&#305;n&#305; en aza indirecek uygulamalara ihtiya&ccedil; vard&#305;r.</span></p><p class="c1"><span class="c4">Diktasyon ve sesi metne d&ouml;n&uuml;&#351;t&uuml;ren yaz&#305;l&#305;mlar&#305;n makroskopik ve mikroskopik tariflerde kullan&#305;m&#305; yayg&#305;nla&#351;maktad&#305;r.</span></p><h4 class="c14" id="h.cggxghrl86en"><span class="c16">G&ouml;r&uuml;nt&uuml;ler</span></h4><p class="c24"><span class="c20">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Morfolojik analize dayanan anatomik patolojideki bilgilerden biri de g&ouml;r&uuml;nt&uuml;lerdir. Makroskopik ve mikroskopik g&ouml;r&uuml;nt&uuml;ler mevcuttur.</span></p><p class="c24"><span class="c20">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c39 c20">&ldquo;Makroskopik&rdquo;</span><span class="c4">&nbsp;g&ouml;r&uuml;nt&uuml;lerin net bir &#351;ekilde elde edilmesi ve saklanmas&#305; giderek &ouml;nem kazanmaktad&#305;r. Tariflenen baz&#305; bulgular&#305;n (mezorektal b&uuml;t&uuml;nl&uuml;k gibi) daha sonra tekrar de&#287;erlendirilmesi, delici kesici yaralanmalar gibi mikroskopla belirlenemeyecek medikolegal d&ouml;k&uuml;mantasyonun sa&#287;lanmas&#305; gibi nedenlerle, patoloji ve hastane bilgi sistemlerine entegre makroskopi resim saklama gereklili&#287;i giderek artmaktad&#305;r.</span></p><p class="c24"><span class="c20">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Makroskopik g&ouml;r&uuml;nt&uuml;lerin radyoloji ile korelasyonu ve &uuml;&ccedil; boyutlu g&ouml;r&uuml;nt&uuml;lerle sanal ger&ccedil;eklik uygulamalar&#305; makroskopik g&ouml;r&uuml;nt&uuml; ar&#351;ivinin &ouml;nemini giderek art&#305;rmaktad&#305;r.</span></p><p class="c11"><span>&ldquo;</span><span class="c39">Mikroskopik&rdquo;</span><span class="c2">&nbsp;g&ouml;r&uuml;nt&uuml;lerin tam y&uuml;zey taranmas&#305; (whole slide imaging) ile h&#305;zlanan dijital patolojiye bir sonraki b&ouml;l&uuml;mde detayl&#305; de&#287;inilecektir. Art&#305;k g&uuml;n&uuml;m&uuml;zde dokunun kesit almadan &uuml;&ccedil; boyutlu haritaland&#305;r&#305;lmas&#305;, fiziksel olarak boyanmadan sanal boyalar ile incelenmesi ve bunlar&#305;n &ouml;rnek yeterlili&#287;inde ve h&#305;zl&#305; tan&#305;da kullan&#305;lmas&#305; olduk&ccedil;a s&#305;k yap&#305;lan ve prati&#287;e ge&ccedil;ece&#287;i umulan &ccedil;al&#305;&#351;malard&#305;r.</span></p><p class="c11"><span>&#304;ki boyutlu klasik mikroskopik g&ouml;r&uuml;nt&uuml;lerin &ccedil;ok&ccedil;a kesit al&#305;narak 3 boyutlu rekonstriksiyonu ile yap&#305;lan t&uuml;m&ouml;r modelleri, hastal&#305;klar&#305;n patofizyolojisinin anla&#351;&#305;lmas&#305;nda yeni olanaklar sunacakt&#305;r. Patolojinin gelecegindeki yeni teknikler aras&#305;nda &uuml;&ccedil; boyutlu g&ouml;r&uuml;nt&uuml;leme, RAman spektroskopisi, FTIR (infrared spectroskop), sanal HE boyama, ve konfokal mikroskopi gibi tekniklerin yer almas&#305; beklenmektedir.</span></p><h3 class="c0" id="h.o15fi6sym2dw"><span class="c26">Dijital Patoloji Nedir?</span></h3><p class="c11"><span class="c2">Dijital patoloji dendi&#287;inde g&uuml;n&uuml;m&uuml;zde preparatlar&#305;n t&uuml;m y&uuml;zey y&uuml;ksek &ccedil;&ouml;z&uuml;n&uuml;rl&uuml;kte taranarak bilgisayar ortam&#305;na aktar&#305;lmas&#305; ve bu g&ouml;r&uuml;nt&uuml;lerin iletilme ve i&#351;lenme s&uuml;reci akla gelmekte ise de; t&uuml;m laboratuvar i&#351;leyi&#351;inin bilgisayarla takip edilmesi ve gerekti&#287;inde otomatize edilmesi daha kapsay&#305;c&#305; bir tan&#305;mlama olacakt&#305;r. </span></p><p class="c11"><span class="c2">Makroskopik g&ouml;r&uuml;nt&uuml;lerinin, endoskopik g&ouml;r&uuml;nt&uuml;lerin ve mikroskopla &ccedil;ekilen foto&#287;raflar &uuml;zerinde morfometrik &ccedil;al&#305;&#351;malar dijital patolojinin ba&#351;lang&#305;c&#305;d&#305;r. Ancak hasta tan&#305;s&#305; i&ccedil;in ilk etapta mikroskop yerine dijital g&ouml;r&uuml;nt&uuml;lerin kullan&#305;m&#305; hen&uuml;z daha yeni oldu&#287;undan, bu ama&ccedil;la kullan&#305;lan dijital patoloji daha &ccedil;ok b&uuml;y&uuml;k laboratuvar ve &uuml;niversite hastaneleri ile s&#305;n&#305;rl&#305;d&#305;r.</span></p><p class="c11"><span class="c2">Dijital patoloji ilk etapta ara&#351;t&#305;rma ve e&#287;itim amac&#305;yla kullan&#305;lmaya ba&#351;lanm&#305;&#351;, daha sonra kons&uuml;ltasyon ve frozenda yerini alm&#305;&#351;t&#305;r. Bir hastan&#305;n ilk tan&#305;s&#305; i&ccedil;in kullan&#305;m&#305; yak&#305;n zamanda pandeminin getirdi&#287;i uzaktan &ccedil;al&#305;&#351;ma zorunlulu&#287;u ile h&#305;zl&#305; onay alm&#305;&#351;t&#305;r.</span></p><p class="c11"><span class="c2">Pratikte dijital patolojinin bizi en &ccedil;ok zorlayan k&#305;sm&#305;, haz&#305;r tan&#305;sal hale gelmi&#351; preparatlar&#305;n bir daha tekrardan tan&#305; i&ccedil;in uygun hale d&ouml;n&uuml;&#351;t&uuml;r&uuml;lmesi ile u&#287;ra&#351;mak zorunda kalmam&#305;zd&#305;r. Mesela radyolojinin bas&#305;l&#305; filmlerini devasa taray&#305;c&#305;larla taray&#305;p dijital ortama aktarsayd&#305;k ve ad&#305;na da &lsquo;dijital radyoloji&rsquo; deseydik herhalde bug&uuml;n yap&#305;lana benzer olurdu. </span></p><p class="c11"><span class="c2">Patoloji makroskopi resimlerinin ve preparatlar&#305;n&#305;n dijital ortama aktar&#305;lmas&#305; ve tan&#305;n&#305;n buradan verilmesi, daha &ouml;nceleri analitik evrede kabul etti&#287;imiz basamaklar&#305;n preanalitik evreye ge&ccedil;mesine neden olmu&#351;tur. Art&#305;k laboratuvar sadece preparat&#305;n tan&#305;sal hale gelmesine de&#287;il ayn&#305; zamanda dijital g&ouml;r&uuml;nt&uuml;n&uuml;n de tan&#305;ya haz&#305;r hale gelmesini d&uuml;&#351;&uuml;nerek planlama yapmak durumundad&#305;r. Bu yeniden tan&#305;sal hale getirme basama&#287;&#305; nedeniyle, taray&#305;c&#305;lar yeni bir analitik basamak halini al&#305;rken, taray&#305;c&#305; &ouml;ncesinde laboratuvardaki basamaklar da yeni bir t&uuml;r preanalitik basamak halini almaktad&#305;r. Mesela, &ouml;nceleri sadece insan&#305;n okuyabilece&#287;i etiketler yeterli olurken art&#305;k t&uuml;m laboratuvar s&uuml;recinde makinalar&#305;n da okuyabilece&#287;i barkod ya da karekod kullan&#305;m&#305; zorunlu hale gelmi&#351;tir. Daha &ouml;nceleri g&ouml;rmezden gelinebilecek k&uuml;&ccedil;&uuml;k artefaktlar, hava kabarc&#305;klar&#305;, parmak izleri tarama kalitesini belirli &ouml;l&ccedil;&uuml;de etkiledi&#287;i i&ccedil;in &ldquo;yeni ku&#351;ak preanalitik hatalar&rdquo; olarak hayat&#305;m&#305;za girmektedir. </span></p><p class="c10"><span class="c2"></span></p><p class="c10"><span class="c2"></span></p><p class="c28"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 624.00px; height: 316.00px;"><img alt="" src="images/image1.jpg" style="width: 624.00px; height: 316.00px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c28"><span class="c2">Adenoskuam&ouml;z kanserin sanal patoloji mapesi ile vakan&#305;n incelenmesi. Farkl&#305; boyalar ayn&#305; anda incelenerek t&uuml;m&ouml;rdeki farkl&#305; bile&#351;enler kolayl&#305;kla de&#287;erlendirilebilir.</span></p><p class="c10"><span class="c2"></span></p><p class="c10"><span class="c2"></span></p><p class="c10"><span class="c2"></span></p><p class="c28"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 609.00px; height: 278.80px;"><img alt="" src="images/image6.jpg" style="width: 624.00px; height: 511.02px; margin-left: 0.00px; margin-top: -177.21px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c24"><span class="c4">Ampulla yerle&#351;imli intraamp&uuml;ller papiller neoplazi zemininde geli&#351;mi&#351; adenokarsinomun megalamda al&#305;nan &ouml;rne&#287;inin dijitalle&#351;tirilmi&#351; hali. Birka&ccedil; lamda ancak incelenebilecek g&ouml;r&uuml;nt&uuml;n&uuml;n megalam taray&#305;c&#305;s&#305; ile al&#305;nan bu g&ouml;r&uuml;nt&uuml;s&uuml; sayesinde hem t&uuml;m&ouml;r&uuml;n yay&#305;l&#305;m&#305; daha kolay anla&#351;&#305;labiliyor, hem radyolojik korelasyon daha kolay yap&#305;labiliyor hem de t&uuml;m&ouml;r biyolojisini anlamak daha da kolayla&#351;&#305;yor.</span></p><p class="c6"><span class="c4"></span></p><p class="c6"><span class="c4"></span></p><p class="c11 c29"><span class="c2"></span></p><p class="c11 c29"><span class="c2"></span></p><p class="c12"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 520.00px; height: 276.00px;"><img alt="" src="images/image5.png" style="width: 624.00px; height: 276.00px; margin-left: -104.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c12"><span class="c2">Kirli bir lamda otomatik doku tespit algoritmas&#305;n&#305;n yan&#305;lmas&#305;na bir &ouml;rnek. Ye&#351;il kutu i&ccedil;indeki alan doku olarak alg&#305;lanm&#305;&#351; ve taranm&#305;&#351;t&#305;r.</span></p><p class="c5"><span class="c2"></span></p><p class="c5"><span class="c2"></span></p><p class="c12"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 624.00px; height: 287.82px;"><img alt="" src="images/image2.png" style="width: 624.00px; height: 331.00px; margin-left: 0.00px; margin-top: -43.18px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c11"><span class="c2">Lamda parafin art&#305;&#287;&#305; kalmas&#305; sonucu bulan&#305;k taranm&#305;&#351; dokunun (solda), lam temizlendikten sonra tekrar tarand&#305;&#287;&#305;ndaki net g&ouml;r&uuml;nt&uuml;s&uuml; (sa&#287;da).</span></p><p class="c11 c29"><span class="c2"></span></p><p class="c12"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 470.00px; height: 278.00px;"><img alt="" src="images/image4.png" style="width: 624.00px; height: 321.00px; margin-left: -154.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c11"><span class="c2">Akordiyon artefakt&#305;: Eskiden kesit s&#305;ras&#305;nda mikrotoma b&#305;&ccedil;a&#287;&#305;n tam yerle&#351;tirilmemesi nedeniyle g&ouml;r&uuml;len bu artefakt, dijital tarama s&#305;ras&#305;nda kalibrasyonun tam yap&#305;lmad&#305;&#287;&#305; durumlarda da g&ouml;r&uuml;lmeye ba&#351;lam&#305;&#351;t&#305;r. Bu gibi yeni ku&#351;ak artefaktlara haz&#305;rl&#305;kl&#305; olmam&#305;z gerekmektedir.</span></p><p class="c11"><span class="c2">&nbsp;</span></p><h4 class="c14" id="h.obkyw9np1bl4"><span class="c16">Dijital patolojinin kullan&#305;m alanlar&#305; nelerdir?</span></h4><p class="c11"><span class="c2">Dijital patoloji ilk ba&#351;larda ara&#351;t&#305;rma ve e&#287;itim amac&#305;yla kullan&#305;lmaya ba&#351;lanm&#305;&#351;, daha sonra kons&uuml;ltasyon ve frozenda yerini alm&#305;&#351;t&#305;r. Bir hastan&#305;n ilk tan&#305;s&#305; i&ccedil;in mikroskop yerine dijital g&ouml;r&uuml;nt&uuml;lerin kullan&#305;lmas&#305; ba&#351;lang&#305;&ccedil;la teredd&uuml;tle kar&#351;&#305;lanm&#305;&#351;t&#305;r. Covid pandemisinin getirdi&#287;i uzaktan &ccedil;al&#305;&#351;ma zorunlulu&#287;u dijital patolojinin tan&#305; ama&ccedil;l&#305; kullan&#305;lmas&#305;n&#305;n onaylanmas&#305; i&ccedil;in h&#305;zland&#305;r&#305;c&#305; bir fakt&ouml;r olmu&#351;tur.</span></p><p class="c11"><span class="c2">Rosai&rsquo;nin kongrelerde kahve bardaklar&#305;ndan d&uuml;rb&uuml;nler yapt&#305;&#287;&#305; ve kat&#305;l&#305;mc&#305;lardan ekrandaki sunuma &ouml;nce bu d&uuml;rb&uuml;nle sonra da bu d&uuml;rb&uuml;ns&uuml;z bakmalar&#305;n&#305; istedi&#287;i ve bu &#351;ekilde dijital patolojinin gelece&#287;ini &ouml;ng&ouml;rd&uuml;&#287;&uuml; s&ouml;ylenir.</span></p><p class="c11"><span class="c2">Dijital patoloji, hastal&#305;klar&#305;n tan&#305;s&#305;na yard&#305;mc&#305; &ouml;zelliklerin tespit edilmesinde ek bir ara&ccedil; olarak yayg&#305;n olarak kullan&#305;lmaktad&#305;r. Karaci&#287;er ya&#287;lanmas&#305;n&#305;n &ouml;l&ccedil;&uuml;lmesi, t&uuml;m&ouml;r b&uuml;y&uuml;kl&uuml;&#287;&uuml;n&uuml;n ve derinli&#287;inin &ouml;l&ccedil;&uuml;lmesi, t&uuml;m&ouml;r&uuml;n cerrahi s&#305;n&#305;rlara olan uzakl&#305;klar&#305;n&#305;n tespiti, t&uuml;m&ouml;r ile &ccedil;evre dokunun ayr&#305;lmas&#305; ve imm&uuml;nohistokimyasal belirte&ccedil;lerin say&#305;sal olarak do&#287;ru raporlanmas&#305; gibi alanlarda geli&#351;tirilmi&#351; yaz&#305;l&#305;m ve karar destek sistemleri mevcuttur.</span></p><h5 class="c22" id="h.709d8vgh3c0s"><span>E&#287;itim</span></h5><p class="c1"><span class="c4">Hem t&#305;p fak&uuml;ltesi hem uzmanl&#305;k e&#287;itiminde verilen mikroskop e&#287;itimlerinde sorunlardan birisi de preparatlar&#305;n eskimesi ve nadir vakalar&#305;n say&#305;ca az olmas&#305;d&#305;r. Dijital g&ouml;r&uuml;nt&uuml;ler ile hem bu sorun a&#351;&#305;lacak, hem de interaktif &ouml;gelerin de kullan&#305;m&#305; ile farkl&#305; e&#287;itim teknikleri kullan&#305;labilecektir. 3 boyutlu organ modellerinin sanal ger&ccedil;eklikle incelendi&#287;i, retina takibi ile mitoz sayma yar&#305;&#351;malar&#305;n&#305;n d&uuml;zenlendi&#287;i, makroskopide merak edilen alan&#305;n mikroskopide nas&#305;l yans&#305;d&#305;&#287;&#305;n&#305;n hemen g&ouml;r&uuml;ld&uuml;&#287;&uuml;, mikroskobik kesitlerin 3 boyutlu rekonstr&uuml;ksiyonu ile t&uuml;m&ouml;r yay&#305;l&#305;m&#305;n&#305;n daha iyi anla&#351;&#305;ld&#305;&#287;&#305; e&#287;itim teknikleri gelece&#287;in hekimlerini, gelece&#287;in teknolojileri i&ccedil;in haz&#305;rlayacakt&#305;r. </span></p><p class="c1"><span class="c4">Mikroskoptan ekrana ge&ccedil;i&#351;te bu ku&#351;a&#287;&#305;n ya&#351;ad&#305;&#287;&#305; sorunlar&#305;n tam tersinin ekrandan konvansiyonel mikroskopa ge&ccedil;ecek yeni ku&#351;a&#287;&#305;n ya&#351;ayaca&#287;&#305;n&#305; tahmin edebiliriz.</span></p><p class="c24"><span class="c4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uuml;lkemizde genellikle digital slaytlar kullan&#305;larak yukar&#305;da s&ouml;z&uuml; edilen teknik sorunlar&#305;n d&uuml;zeltildi&#287;i ve a&#351;&#305;ld&#305;&#287;&#305; g&ouml;r&uuml;lmekle beraber interaktif e&#287;itim teknikleri entegre edilmeden kullan&#305;lmas&#305;sonucu bu y&ouml;ntemin getirilerinden yeterince yararlan&#305;lamad&#305;&#287;&#305; g&ouml;r&uuml;lmektedir. </span></p><h5 class="c22" id="h.1uaccoofz90g"><span class="c36">Kons&uuml;ltasyon</span></h5><p class="c24"><span class="c4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Konunun eksper patolo&#287;una ula&#351;mak i&ccedil;in daha &ouml;nceleri lam ya da blo&#287;un g&ouml;nderilmesi, hatta bunun i&ccedil;in &#351;ehirleraras&#305; ya da &uuml;lkeler aras&#305; transfer gerekmekteydi. Art&#305;k bu g&ouml;r&uuml;nt&uuml;lerin (gigabaytlarca yer tutan sanal g&ouml;r&uuml;nt&uuml;lerin bile g&ouml;nderilmeden) olu&#351;turulacak bir link &uuml;zerinden payla&#351;&#305;lmas&#305; ile kons&uuml;ltasyonlar rutin prati&#287;in kolay basamaklar&#305;ndan biri olacakt&#305;r. Bu durum ileride uzaktan &ccedil;al&#305;&#351;ma ile i&#351; piyasas&#305;na da farkl&#305; yakla&#351;&#305;mlar getirecektir.</span></p><h5 class="c22" id="h.my1p3146q47a"><span class="c36">Rutin Raporlama</span></h5><p class="c11"><span class="c2">&Ouml;nceleri ilgili vakaya ait lamlar&#305;n t&uuml;m&uuml; s&#305;ralanm&#305;&#351; bir &#351;ekilde mapeye dizilip, klinik ve makroskopik bilginin yer ald&#305;&#287;&#305; ka&#287;&#305;tla bir araya getirildi&#287;inde laboratuvar&#305;n i&#351;i bitmi&#351; ve vakan&#305;n patolog taraf&#305;ndan onaylanma s&uuml;reci ba&#351;lam&#305;&#351; oluyordu. T&uuml;m&uuml;yle dijital ortama ta&#351;&#305;nan bir laboratuvarda lamlar&#305; mapeye dizmeye gerek olmad&#305;&#287;&#305; gibi lamlar&#305;n herhangi bir s&#305;rayla taranmas&#305; da gerekmiyor. Ayr&#305;ca ka&#287;&#305;tlardaki bilgilerin de hepsinin dijitalle&#351;ti&#287;ini d&uuml;&#351;&uuml;n&uuml;rsek fiziksel bir teslimat&#305;n yap&#305;lmas&#305;na da gerek kalm&#305;yor. </span></p><p class="c11"><span class="c2">&Ouml;te yandan tarama i&ccedil;in ge&ccedil;en s&uuml;re, vakan&#305;n her lam&#305;n&#305;n taran&#305;p taranmad&#305;&#287;&#305;n&#305;n kontrol&uuml;, g&ouml;r&uuml;nt&uuml;lerin tan&#305;sal yeterlilikte olup olmad&#305;&#287;&#305;n&#305;n kontrol&uuml; gibi ek otomatize ya da manuel kontrol basamaklar&#305; da g&uuml;nl&uuml;k prati&#287;e eklenmektedir. Tarama i&ccedil;in ge&ccedil;en s&uuml;renin k&#305;salt&#305;lmas&#305;nda s&uuml;rekli y&uuml;kleme yap&#305;labilen modeller daha ba&#351;ar&#305;l&#305; olmaktad&#305;r.</span></p><p class="c11"><span class="c2">Dijital g&ouml;r&uuml;nt&uuml;ler kullanarak rutin raporlamaya yava&#351; yava&#351; ge&ccedil;ilmektedir. Ge&ccedil;i&#351; s&uuml;recinde ya&#351;anabilecek sorunlar ve &ccedil;&ouml;z&uuml;mleri i&ccedil;in derneklerin, RCAP ve Leeds &Uuml;niversitesi&#39;nin haz&#305;rlad&#305;&#287;&#305; &ouml;neriler olduk&ccedil;a faydal&#305;d&#305;r (Bkz. Okuma &ouml;nerileri)</span></p><p class="c11"><span class="c2">Bu yeni y&ouml;ntemler kendi ergonomi sorunlar&#305;n&#305; da birlikte getirmektedir. &#350;aryo kullanmaya ve objektif de&#287;i&#351;tirmeye al&#305;&#351;k&#305;n patolog kas haf&#305;zas&#305; (muscle memory) klasik bilgisayar faresi ile e&#351;le&#351;mekten uzakt&#305;r. Bu nedenl 3D fareler ve &#351;aryoyu taklit eden bilgisayar bile&#351;enleri geli&#351;tirilmektedir. Nas&#305;l bir ekran kullan&#305;laca&#287;&#305; ve ekran&#305;n &ldquo;t&#305;bbi ekran&rdquo; kategorisinde olup olmamas&#305; gerekti&#287;i de s&uuml;regiden bir tart&#305;&#351;ma konusudur (Bkz. Leeds ekran testi) </span></p><p class="c11"><span class="c2">&#304;&#351;aretleme al&#305;&#351;kanl&#305;&#287;&#305;n&#305;n de&#287;i&#351;mesi (lamlara yaz&#305;lan yaz&#305;lar&#305;n art&#305;k ekrandan yaz&#305;lmas&#305;, lamlardaki i&#351;aretlerin taramada artefakt olu&#351;turmas&#305;), k&uuml;&ccedil;&uuml;k fragmanlar&#305;n tarama s&#305;rac&#305;nda ya da patolog bakarken atlanmas&#305; endi&#351;esi de g&uuml;ncel tart&#305;&#351;malardand&#305;r.</span></p><p class="c11"><span class="c2">&#304;lk &ccedil;al&#305;&#351;&#305;lmaya ba&#351;lanan, tek tip h&uuml;cre grubundan olu&#351;tu&#287;u i&ccedil;in ve patern analizi gerektirmedi&#287;i i&ccedil;in kolay oldu&#287;u varsay&#305;lan servikal yaymalar dijital patolojide hala &ouml;nc&uuml; yer tutamamaktad&#305;r. Bunun sebebi aras&#305;nda Z-stack taraman&#305;n daha zor ve maliyetli olmas&#305; yer almaktad&#305;r. Mikrovida ile de&#287;i&#351;ik katlara bakmaya al&#305;&#351;k&#305;n sitolog ve patolog g&ouml;z&uuml; yeni sistemlerde bu kolayl&#305;&#287;&#305; kolayca elde edememektedir. &Ouml;te yandan HPV testlerinin daha yayg&#305;n olmas&#305; maliyet etkinlik a&ccedil;&#305;s&#305;ndan servikal yaymalar&#305;n dijital taranmas&#305; i&ccedil;in harcanan emeklerin &ouml;n&uuml;nde yer almaktad&#305;r. &nbsp;</span></p><p class="c1"><span class="c4">Floresan kullan&#305;larak yap&#305;lan incelemeler (FISH, DIF) i&ccedil;in ayr&#305; tarama sistemleri gerekmektedir. &Ccedil;ift k&#305;r&#305;c&#305;l&#305;k gerektiren de&#287;erlendirmeler (kongo k&#305;rm&#305;z&#305;s&#305;, yabanc&#305; cisim) i&ccedil;inse hala klasik mikroskopa ihtiya&ccedil; duyulmaktad&#305;r.</span></p><p class="c1"><span class="c20">Eski vakalar&#305;n ya da kons&uuml;ltasyon i&ccedil;in farkl&#305; laboratuvarda haz&#305;rlan&#305;p g&ouml;nderilen lamlar&#305;n taranmas&#305; ve ar&#351;ivlenmesi hem zaman hem de maliyet a&ccedil;&#305;s&#305;ndan de&#287;erlendirilmelidir. &Ouml;zellikle soluk ve kapama sorunu olan vakalar&#305;n taranmas&#305; s&#305;ras&#305;nda olu&#351;acak artefaktlar g&ouml;z &ouml;n&uuml;nde bulundurulmal&#305;d&#305;r.</span></p><p class="c12"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dijital g&ouml;r&uuml;nt&uuml;ler ile raporlamaya ge&ccedil;meden &ouml;nce en az 60 vakan&#305;n hem preparat hem de dijital g&ouml;r&uuml;nt&uuml; ile ayr&#305; ayr&#305; raporlanmas&#305; ve aralar&#305;ndaki uyumlulu&#287;un test edilip d&ouml;k&uuml;mante edilmesini i&ccedil;eren ki&#351;isel validasyon &ccedil;al&#305;&#351;malar&#305;na ihtiya&ccedil; vard&#305;r. Bu rakam&#305;n her boya, her &ouml;rnek t&uuml;r&uuml; ve her tan&#305;ya g&ouml;re hedeflenmesi istenmekle birlikte, kesin bir say&#305; olmay&#305;p ilgili biyopsi t&uuml;r&uuml;nde patolo&#287;un kendini rahat hissedecek ve tan&#305; aray&uuml;z&uuml; ile a&#351;inal&#305;k kazanacak kadar devam etmesi &ouml;nerilmektedir.</span></p><p class="c5"><span class="c2"></span></p><h4 class="c34" id="h.sthjtaf42zrs"><span class="c16">Dijital Taray&#305;c&#305; Al&#305;nca Dijital Patolojiye Ge&ccedil;mi&#351; Olabilir miyiz?</span></h4><p class="c24"><span class="c4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dijital patoloji konusunda &ccedil;al&#305;&#351;ma yapan dernekler taray&#305;c&#305; al&#305;m&#305;n&#305; laboratuvarda yap&#305;lacak d&uuml;zenlemelerden sonra olmas&#305;n&#305; &ouml;nermektedir. E&#287;er laboratuvar i&#351; ak&#305;&#351;&#305; barkod ile d&uuml;zenlenmemi&#351;, ilgili lam&#305;n barkodu ile patoloji bilgi sistemi ve hastane bilgi sisteminden gerekli bilgiler al&#305;namayacak ise, taray&#305;c&#305;dan elde edilen g&ouml;r&uuml;nt&uuml;lerin i&#351;lenmesi olduk&ccedil;a zor olmaktad&#305;r. Bu gruplanm&#305;&#351; yan veriler (parsed metadata) otomatizasyonun en &ouml;nemli k&#305;sm&#305;n&#305; olu&#351;turmaktad&#305;r.</span></p><p class="c24"><span class="c4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;G&ouml;r&uuml;nt&uuml;n&uuml;n nereye ve ne kadar s&uuml;re ile kaydedilece&#287;i, hangi di&#287;er lamlar ile e&#351;le&#351;ece&#287;i, nas&#305;l bir &lsquo;sanal mape&rsquo; ile patolo&#287;a iletilece&#287;i, e&#287;er yapay zeka algoritmalar&#305; kullan&#305;lacaksa hangi lam&#305;n i&#351;lenece&#287;i ancak bu b&uuml;t&uuml;nl&uuml;k sa&#287;lanabilirse m&uuml;mk&uuml;n olacakt&#305;r.</span></p><p class="c1"><span class="c4">&Ouml;rne&#287;in g&uuml;n&uuml;m&uuml;zde meme biyopsileri i&ccedil;in yap&#305;lan hormon resept&ouml;r incelemelerini patolo&#287;a g&ouml;r&uuml;nt&uuml; iletilmeden analiz edecek ve patolo&#287;a &ouml;n rapor sunacak algoritmalar mevcuttur. Ancak bu algoritman&#305;n &ccedil;al&#305;&#351;abilmesi i&ccedil;in o lam&#305;n bir meme biyopsisine ait oldu&#287;u, o lamdaki boyaman&#305;n bir hormon resept&ouml;r&uuml;ne ait oldu&#287;u ve boyama de&#287;erlendirmesi i&ccedil;in &ccedil;al&#305;&#351;acak spesifik algoritman&#305;n ne oldu&#287;u belli olmal&#305;d&#305;r.</span></p><p class="c1"><span class="c4">Laboratuvardaki t&uuml;m cihazlar ayn&#305; barkod bilgisi ile &ccedil;al&#305;&#351;abilecek, ya da barkoddan kendisi ile ilgili alan&#305; okuyabilecek &#351;ekilde d&uuml;zenlenmi&#351; olmal&#305;d&#305;r. G&uuml;n&uuml;m&uuml;zde kaset, imm&uuml;nohistokimya ve tayar&#305;c&#305;lardaki farkl&#305; barkod / karekod / datamatrix kullan&#305;m&#305; ve bu i&ccedil;eri&#287;in firmalara &ouml;zg&uuml;n ve de&#287;i&#351;tirilemez olarak tan&#305;mlanmas&#305;, kesintisiz bir laboratuvar i&#351; ak&#305;&#351;&#305; &ouml;n&uuml;ndeki &ouml;nemli engellerden biridir.</span></p><p class="c1"><span class="c4">T&uuml;m y&uuml;zey taramadaki g&ouml;r&uuml;nt&uuml;ler olduk&ccedil;a fazla yer kaplamaktad&#305;r. Radyoloji g&ouml;r&uuml;nt&uuml;leri ile k&#305;yasland&#305;&#287;&#305;nda bu fazlal&#305;k daha da &ccedil;arp&#305;c&#305; olarak g&ouml;r&uuml;lmektedir. G&ouml;r&uuml;nt&uuml;lerin daha az yer kaplamas&#305; i&ccedil;in 40x yerine 20x tarama, bo&#351; lam alanlar&#305;n&#305;n taranmamas&#305; gibi &ccedil;&ouml;z&uuml;mler kullan&#305;lmaktad&#305;r. Ancak bu durumda da fragmante dokular&#305;n taranmamas&#305; riski yan&#305;s&#305;ra, taranan her lam&#305;n tan&#305; i&ccedil;in yeterli oldu&#287;unun teyidi gibi ek bir i&#351; basama&#287;&#305; da ortaya &ccedil;&#305;kmaktad&#305;r.</span></p><p class="c24"><span class="c4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bu gibi optimizasyonlar (d&uuml;zenlemeler) yap&#305;lmad&#305;k&ccedil;a patolo&#287;un i&#351; y&uuml;k&uuml;n&uuml; kolayla&#351;t&#305;rmak yerine zorla&#351;t&#305;racak hale gelen dijital tarama beklenen verimlilikte kullan&#305;lamayacakt&#305;r.</span></p><p class="c5"><span class="c2"></span></p><h4 class="c14" id="h.bbzknje9hu0n"><span class="c16">Dijital patoloji i&ccedil;in taray&#305;c&#305;ya ihtiyac&#305;m&#305;z var m&#305;?</span></h4><p class="c24"><span class="c4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dijital patolojinin kolayl&#305;klar&#305;ndan faydalanmak i&ccedil;in mutlaka taray&#305;c&#305;n&#305;n olmas&#305;na gerek yoktur. Ara&#351;t&#305;rma, kons&uuml;ltasyon ve tan&#305;ya katk&#305; sa&#287;layacak algoritmalar&#305;n kullan&#305;lmas&#305; i&ccedil;in &ccedil;o&#287;u zaman kamera ba&#287;l&#305; mikroskop yeterli olacakt&#305;r. Hatta cep telefonlar&#305;n&#305;n g&ouml;r&uuml;nt&uuml; almas&#305; i&ccedil;in geli&#351;tirilen ok&uuml;lere ba&#287;lanan ata&ccedil;manlar ile trinok&uuml;ler mikroskop olmadan da g&ouml;r&uuml;nt&uuml;ler elde edilebilmektedir.</span></p><p class="c1"><span class="c4">Mikroskopta lam&#305;n hareket ettirilmesi ile &ccedil;ekilen g&ouml;r&uuml;nt&uuml;lerin birle&#351;tirildi&#287;i &ldquo;manuel whole slide imaging&rdquo; yaz&#305;l&#305;mlar&#305; da kullan&#305;labilmektedir.</span></p><p class="c1"><span class="c4">Bir kez taranm&#305;&#351; g&ouml;r&uuml;nt&uuml; elde edildikten sonra bu g&ouml;r&uuml;nt&uuml;leri g&ouml;sterecek ve analiz edecek a&ccedil;&#305;k kaynak programlar olduk&ccedil;a yayg&#305;n olarak mevcut olmakla birlikte hala daha manuel tam y&uuml;zey taraman&#305;n kullan&#305;labilece&#287;i a&ccedil;&#305;k kaynak programlar&#305;n olmamas&#305; dijital patoloji &ouml;n&uuml;ndeki en b&uuml;y&uuml;k &lsquo;finansal&rsquo; engel olarak durmaktad&#305;r.</span></p><p class="c6"><span class="c4"></span></p><h4 class="c14" id="h.vual0cka0ms2"><span class="c16">Dijital patolojinin gelece&#287;i</span></h4><p class="c1"><span class="c4">Dijital patoloji h&#305;zla geli&#351;en bir alan oldu&#287;undan patologlar&#305;n kendilerini bu geli&#351;melere haz&#305;rlamalar&#305; gerekmektedir. Altyap&#305; yat&#305;r&#305;mlar&#305; s&#305;ras&#305;nda geli&#351;tirilebilir mod&uuml;ler yap&#305;lar&#305;n tercih edilmesi; basit ekran payla&#351;&#305;m&#305;ndan &ouml;teye gitmeyen ve a&ccedil;&#305;k kaynak ile ula&#351;&#305;labilecek programlar i&ccedil;in masraf yapmadan &ouml;nce yetkin g&ouml;r&uuml;&#351; al&#305;nmas&#305; &ouml;nerilmektedir. </span></p><p class="c1"><span class="c4">Dijital patoloji g&ouml;r&uuml;nt&uuml;leri &#351;u an farkl&#305; firmalara ait farkl&#305; formatlar halindedir. Ancak yak&#305;n zamanda ortak bir format olan DICOM&rsquo;a ge&ccedil;ilmesi ile cihazlar aras&#305;ndaki uyum da artacakt&#305;r. Bu ortak formata ge&ccedil;ilmesi ile g&ouml;r&uuml;nt&uuml;lerin daha uygun saklanabilmesi i&ccedil;in de geli&#351;tirmeler h&#305;zlanacakt&#305;r.</span></p><p class="c6 c17"><span class="c4"></span></p><h3 class="c0" id="h.gqvymaqxmczf"><span>Yapay Zekan&#305;n dijital patolojideki yeri</span></h3><p class="c24"><span class="c4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Yapay zekan&#305;n g&ouml;r&uuml;nt&uuml;ler &uuml;zerindeki tecr&uuml;besinin patolojiye aktar&#305;lmas&#305; ile bilimsel &ccedil;al&#305;&#351;malarda s&#305;k g&ouml;rmeye ba&#351;lad&#305;&#287;&#305;m&#305;z yapay zeka (makina &ouml;&#287;renmesi, derin &ouml;&#287;renme) kullan&#305;m&#305; giderek g&uuml;nl&uuml;k prati&#287;e de uygulanabilecek &ouml;zellikler kazanmaktad&#305;r. Yapay zeka ile ilgili &ccedil;al&#305;&#351;malar literat&uuml;rde hesaplamal&#305; patoloji (computational pathology), matematiksel patoloji olarak da ge&ccedil;mektedir. </span></p><p class="c1"><span class="c4">Prostat i&#287;ne biyopsilerinin ve meme biyopsilerinin de yapay zeka ile &ouml;n incelemeden ge&ccedil;irilmesi ve &#351;&uuml;pheli alanlar&#305;n i&#351;aretlenmesi yak&#305;n zamanda rutin kullan&#305;m i&ccedil;in onaylanm&#305;&#351;t&#305;r.</span></p><p class="c1"><span class="c20">Daha &ouml;nce tan&#305; alm&#305;&#351; onbinlerce olgunun g&ouml;r&uuml;nt&uuml;leri ve tan&#305;lar&#305; yapay zeka (artificial intelligence) ve makina &ouml;&#287;renmesi (machine learning) algoritmalar&#305; ile i&#351;lenmektedir. Bu &#351;ekilde &lsquo;&ouml;&#287;renen&rsquo; algoritma yeni gelen olgunun tan&#305;s&#305;nda ya da &ouml;zelliklerinin tespitinde kullan&#305;lmaktad&#305;r. Bu konuda AFIP ve MSKCC ar&#351;ivlerinden elde edilen g&ouml;r&uuml;nt&uuml;lerle ilgili &ccedil;al&#305;&#351;malar yo&#287;un olar</span><span class="c2">ak devam etmektedir.</span></p><p class="c1"><span class="c2">Dijital patolojiye ve genel olarak yapay zekaya y&ouml;neltilen en b&uuml;y&uuml;k ele&#351;tiri algoritmalar&#305;n genelde &lsquo;kapal&#305; kutu&rsquo; (black box) &#351;eklinde olmas&#305;d&#305;r. &#350;&uuml;pheli bir alan&#305;n tespit edildi&#287;inde bu alan&#305;n neden &#351;&uuml;pheli oldu&#287;unu bu algoritmalar a&ccedil;&#305;klayamamaktad&#305;r. Ancak bu durum insan beyni i&ccedil;in de ge&ccedil;erlidir (ara&ccedil; kullan&#305;rken, ya da yemek yerken yapt&#305;&#287;&#305;m&#305;z her hareketi a&ccedil;&#305;klayamay&#305;&#351;&#305;m&#305;z gibi). Eksiklik gibi g&ouml;r&uuml;nen bu durum asl&#305;nda yeni tan&#305; y&ouml;ntemleri geli&#351;tirilmesine olanak tan&#305;makta ve patologlar&#305;n kendilerini de geli&#351;tirmelerine katk&#305; sa&#287;lamaktad&#305;r. Bu durumu Go ve satran&ccedil; oyuncular&#305;n&#305;n kendilerini yapay zeka ile geli&#351;tirmelerine benzetebiliriz. Benzer &#351;ekilde yapay zekan&#305;n yapt&#305;&#287;&#305; hatalar patologlar taraf&#305;ndan tespit edilmekte (kanama pigmenti ile imm&uuml;nohistokimyasal incelemelerin kar&#305;&#351;t&#305;r&#305;lmas&#305; gibi) ve algoritmalar g&uuml;&ccedil;lendirilmektedir.</span></p><p class="c1"><span>Hastan&#305;n hayat&#305;na direk etki edecek sonu&ccedil;lar&#305; olaca&#287;&#305;ndan yapay zekan&#305;n a&ccedil;&#305;klanabilir (explainable AI) olmas&#305; y&ouml;n&uuml;nde &ccedil;al&#305;&#351;malar devam etmektedir. Yapay zeka algoritmalar&#305;n&#305;n hedeflenenden farkl&#305; de&#287;i&#351;kenleri (morfolojik bulgu yerine hastan&#305;n geldi&#287;i klinik gibi veriler) dikkate alabildi&#287;i ve hatal&#305; sonu&ccedil;lar &uuml;retebildi&#287;i bilindi&#287;inden, bu s&uuml;re&ccedil;te kritik edilmekte ve geli&#351;tirmeler bu y&ouml;nde devam etmektedir.</span></p><p class="c7"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Yapay zeka dijital patolojinin kendi i&ccedil;indeki kalite sorunlar&#305;n&#305; &ccedil;&ouml;zebildi&#287;i gibi (renk ve &#305;&#351;&#305;k optimizasyonlar&#305;), laboratuvar&#305;n kalite kontrol basama&#287;&#305;nda da yer alacakt&#305;r. Boya kalitesinin patolo&#287;a iletilmeden test edilmesi, olas&#305; bula&#351;lar&#305;n &ouml;nceden tespit edilmesi gibi uygulamalar rutin i&#351; ak&#305;&#351;&#305;na eklenebilecek hale gelmi&#351;tir. &nbsp;</span></p><p class="c1"><span class="c20">Hemen her </span><span class="c2">y&#305;l tekrarlanan metastatik lenf nodlar&#305;n&#305; tespit edecek yar&#305;&#351;malarda (Grand Challenge) m&uuml;thi&#351; bilgisayar g&uuml;c&uuml; ile Google gibi yaz&#305;l&#305;m firmalar&#305; &ouml;nde yer almaktad&#305;r. Ancak bu sonu&ccedil;lar&#305;n laboratuvarlarda rutinde kullanabilmesi i&ccedil;in g&uuml;&ccedil;l&uuml; bilgisayar yap&#305;s&#305;na ve &ouml;zel ekran kartlar&#305;na (GPU altyap&#305;s&#305;na) ihtiya&ccedil; duyulmaktad&#305;r. Maliyeti y&uuml;ksek olan ve geli&#351;en teknoloji ile s&uuml;rekli g&uuml;ncellenmesi gereken bu altyap&#305;n&#305;n yerine patoloji yapay zeka firmalar&#305; bulut tabanl&#305; &ccedil;&ouml;z&uuml;mler de &ouml;nermektedir. Buluta y&uuml;klenecek g&ouml;r&uuml;nt&uuml;lerin analiz edilmesi ve sonu&ccedil;lar&#305;n tekrar geri g&ouml;nderilmesini sa&#287;layan bu &ccedil;&ouml;z&uuml;mlerde de y&uuml;ksek internet ba&#287;lant&#305; h&#305;zlar&#305; yan&#305; s&#305;ra hasta verisinin farkl&#305; &uuml;lkelerdeki bulut sistemlerine y&uuml;klenmesi konusunda &ccedil;ekinceler bulunmaktad&#305;r.</span></p><p class="c1"><span class="c2">Literat&uuml;rde yer alan &ouml;l&ccedil;&uuml;m temelli &ccedil;al&#305;&#351;malar (ya&#287; oran&#305;, t&uuml;m&ouml;r boyutu, pozitif h&uuml;cre oran&#305; gibi) genelde semikantitativ y&ouml;ntemlere dayanmaktad&#305;r. Bu nedenle bilgisayar destekli yeni tan&#305;lar&#305;n fazla do&#287;ru (hypercorrect) olma ihtimalinin, gereksiz erken tan&#305;lara neden olabilece&#287;i d&uuml;&#351;&uuml;n&uuml;lmektedir. Radyolojideki geli&#351;meler sonras&#305; artan insidentalomalara benzer &#351;ekilde ileride patolojideki erken lezyonlar&#305;n tan&#305;m&#305; da de&#287;i&#351;ecektir. Bu nedenle klinik faydas&#305; olacak e&#351;ik de&#287;erin se&ccedil;ilmesi ve algortimalar&#305;n bunlara g&ouml;re yeniden optimizasyonu gerekecektir.</span></p><p class="c1"><span class="c2">Yapay zeka ile ilgili &ccedil;al&#305;&#351;malarda &ccedil;arp&#305;c&#305; konular ele al&#305;nsa da rutin prati&#287;e etkisi olacak emek yo&#287;un i&#351;lemlerde kullan&#305;m&#305; hala daha k&#305;s&#305;tl&#305;d&#305;r. Morfolojiden sa&#287;kal&#305;m&#305;n ya da genetik &ouml;zelliklerin tahmin edildi&#287;i &ccedil;al&#305;&#351;malar sansasyonel olarak sunulmakla birlikte, rutin (tabiri caizse amele) i&#351;lerde kullan&#305;m&#305; daha geri planda kalmaktad&#305;r. </span></p><p class="c1"><span class="c2">Morfolojiden geneti&#287;in tahmin edilebilece&#287;i, sadece morfoloji ile sa&#287;kal&#305;m hakk&#305;nda &ccedil;&#305;kar&#305;mlar yap&#305;labilece&#287;i ve bu bilgilerin insan&#305;n farkedemeyece&#287;i &ouml;zelliklere dayand&#305;&#287;&#305;n&#305; iddia eden &ccedil;ok say&#305;da &ccedil;al&#305;&#351;ma devam etmektedir.</span></p><p class="c1"><span class="c2">&Ouml;te yandan bu gibi reklam&#305; yap&#305;lamayacak ve sat&#305;&#351; i&ccedil;in &ouml;nemli olmayacak ama hasta sa&#287;l&#305;&#287;&#305; i&ccedil;in &ccedil;ok &ouml;nemli geri plan algoritmalar&#305; da mevcuttur. Mesela her taranan g&ouml;r&uuml;nt&uuml;n&uuml;n rutin olarak kalite kontrolden ge&ccedil;irilip ona g&ouml;re patolo&#287;un g&ouml;rece&#287;i ekrana aktar&#305;lmas&#305; ya da o g&uuml;nk&uuml; t&uuml;m vakalar&#305; birbiri ile k&#305;yaslayarak olas&#305; doku bula&#351;lar&#305;n&#305; tespit edip &ouml;nceden uyar&#305; verilmesi gibi hayati &ouml;neme sahip &ouml;zellikler genelde &ouml;n plana &ccedil;&#305;kamamaktad&#305;r.</span></p><p class="c1"><span class="c2">Farkl&#305; laboratuvarlardaki verilerden geli&#351;tirilen algoritmalar&#305;n di&#287;er laboratuvarlardaki kesit ve boya kalitesi ile uyumlu oldu&#287;unun g&ouml;sterilmesi gereklidir. Yapay zeka ile ilgili beklentilerin realist olmas&#305;, algoritmalar&#305;n ise tekrarlanabilir (kendi i&ccedil;inde ve d&#305;&#351;ar&#305;yla tutarl&#305;), teknik olarak uygulanabilir, klinik prati&#287;e aktar&#305;labilir ve yeni bilgiler &#305;&#351;&#305;&#287;&#305;nda g&uuml;ncellenebilir olmas&#305; gerekmektedir.</span></p><p class="c1"><span class="c2">Gelecekte her mikroskopa bir kameran&#305;n oldu&#287;u, masaba&#351;&#305;nda hemen ula&#351;&#305;labilecek tarama cihazlar&#305;n&#305;n oldu&#287;u &ccedil;al&#305;&#351;ma ortam&#305; yan&#305;s&#305;ra, tamamen mikroskopsuz patoloji i&#351; istasyonlar&#305; da olacakt&#305;r. </span></p><p class="c1"><span class="c2">Algoritma destekli patoloji prati&#287;inde &lsquo;Bu vakay&#305; Alp Hoca&rsquo;ya dan&#305;&#351;al&#305;m&rsquo; yerine &lsquo;Bu vakay&#305; AlpApp v25&rsquo;e y&uuml;kleyelim&rsquo; gibi c&uuml;mleler yer alaca&#287;&#305; gibi, ihtiyaca g&ouml;re uygulama indirilen / geli&#351;tirilen PathAppStore&rsquo;lar&#305; da hayat&#305;m&#305;zdaki yeniliklerden olacakt&#305;r.</span></p><p class="c6 c17"><span class="c2"></span></p><p class="c6 c17"><span class="c2"></span></p><p class="c1"><span class="c2">T&uuml;m bu geli&#351;meler &#305;&#351;&#305;&#287;&#305;nda gelecekte, bili&#351;imin, metin-g&ouml;r&uuml;nt&uuml; i&#351;leme ve yapay zekan&#305;n patoloji b&ouml;l&uuml;mleri i&ccedil;inde bir alt grup olarak yerle&#351;ece&#287;ini ve patoloji laboratuvarlar&#305;nda bili&#351;im sekt&ouml;r&uuml;nden de &ccedil;al&#305;&#351;anlar olaca&#287;&#305; tahmin edilmektedir.</span></p><p class="c6"><span class="c2"></span></p><h3 class="c0" id="h.i6m1nhl216hg"><span class="c26">&#304;lgin&ccedil; ve &ouml;rnek &ccedil;al&#305;&#351;malar</span></h3><p class="c24"><span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c15">&ldquo;QuPath&rdquo;</span><span class="c2">&nbsp;a&ccedil;&#305;k kaynak kodlu ve &uuml;cretsiz biyomedikal g&ouml;r&uuml;nt&uuml; izleme ve inceleme programlar&#305; aras&#305;nda patoloji i&ccedil;in en &ccedil;ok uygulama olana&#287;&#305; olan programlardand&#305;r. Program&#305;n yazar&#305; ve geli&#351;tiricisi Dr. Peter Bankhead g&ouml;r&uuml;nt&uuml; analizi i&ccedil;in doktora yapt&#305;&#287;&#305; s&#305;rada elindeki olanaklar&#305;n yetersizli&#287;ini farkederek bu yaz&#305;l&#305;m&#305; olu&#351;turmaya ba&#351;lam&#305;&#351; ve geli&#351;tirmeye devam etmektedir.</span></p><p class="c1"><span class="c2">Kolay bir aray&uuml;ze sahip bu programda patologlar g&uuml;nl&uuml;k pratikte metrik &ouml;l&ccedil;&uuml;mler, h&uuml;cre say&#305;m&#305; yapabilecekleri gibi kendi vaka setleri ile algortimalar geli&#351;tirebilmektedirler. T&uuml;m&ouml;r ve stromda ayr&#305;m&#305;, farkl&#305; h&uuml;crelerin ve dokular&#305;n ayr&#305;lmas&#305; gibi ara&#351;t&#305;rma ya da rutinde kullan&#305;labilecek &ccedil;ok say&#305;da &ouml;zelli&#287;i mevcuttur. Yak&#305;n zamanda geli&#351;tirilen Python entegrasyonlar&#305; ile de ileride &ccedil;ok daha fazla &ouml;zellik kazanaca&#287;&#305; tahmin edilmektedir.</span></p><p class="c6"><span class="c2"></span></p><p class="c7 c29"><span class="c2"></span></p><p class="c7"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 624.00px; height: 346.67px;"><img alt="" src="images/image3.png" style="width: 624.00px; height: 346.67px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c7"><span class="c2">QuPath ile t&uuml;m&ouml;rdeki m&uuml;sin oran&#305;n&#305; kolayca tespit edebilmek m&uuml;mk&uuml;nd&uuml;r.</span></p><p class="c7 c29"><span class="c2"></span></p><h4 class="c14 c32" id="h.hp33jfhq8eho"><span class="c16"></span></h4><p class="c6"><span class="c2"></span></p><p class="c24"><span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c15">&ldquo;HistoQC&rdquo;</span><span class="c2">&nbsp;a&ccedil;&#305;k kaynak kodlu bir di&#287;er program olan HistoQC ile taranan lam&#305;n ne kadar kaliteli oldu&#287;u, &uuml;zerindeki artefaktalr&#305;n ne kadar yer kaplad&#305;&#287;&#305;, ara&#351;t&#305;rma ama&ccedil;l&#305; yeterli olup olmad&#305;&#287;&#305; tespit edilebilmektedir. Ayr&#305;ca rutin HE boya kalitesi de bu program ile takip edilebilmektedir.</span></p><p class="c12"><span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c15">&ldquo;Octopi&rdquo;</span><span class="c2">&nbsp;Stanford &uuml;niveristesinden Prakash Laboratuvar&#305;&rsquo;n&#305;n geli&#351;tirdi&#287;i Octopi ucuz maliyetli (250 dolar) bir dijital tarama cihaz&#305;d&#305;r. Bu tarama cihaz&#305; periferik kan yaymalar&#305;nda malaria tespiti i&ccedil;in optimize edilmi&#351;tir. Malaria&rsquo;n&#305;n otofloresan &ouml;zelli&#287;i sayesinde h&#305;zl&#305;ca tarama yapan ve tan&#305;sal eritrositleri bulan bu cihaz hem maliyetinin d&uuml;&#351;&uuml;k olmas&#305; hem de d&uuml;nya &ccedil;a&#287;&#305;nda &ouml;nemli bir hastal&#305;&#287;&#305;n taranmas&#305;na katk&#305;da bulunmas&#305; nedeniyle &ouml;nemlidir.</span></p><p class="c12"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bu &ccedil;al&#305;&#351;ma hedefe y&ouml;nelik olarak geli&#351;tirilecek dijital patoloji cihaz ve y&ouml;ntemlerinin ucuz ve etkin olabilece&#287;inin en &ouml;nemli &ouml;rneklerindendir. </span></p><p class="c1"><span class="c2">Di&#287;er a&ccedil;&#305;k kaynak kodlu ve &uuml;cretsiz programlar&#305;n listesi okuma &ouml;nerilerinde verilmi&#351;tir.</span></p><p class="c6 c17"><span class="c2"></span></p><h2 class="c21" id="h.fekiq1as7gqk"><span class="c13">Okuma &ouml;nerileri:</span></h2><p class="c6"><span class="c2"></span></p><ul class="c25 lst-kix_o82qaovqd9jv-0 start"><li class="c12 c18 li-bullet-0"><span>European Society for Digital and Integrative Pathology </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://digitalpathologysociety.org/&amp;sa=D&amp;source=editors&amp;ust=1653997224934597&amp;usg=AOvVaw32XtDfITiAhnDHt_NRn1ym">https://digitalpathologysociety.org/</a></span><span class="c2">&nbsp;</span></li><li class="c12 c18 li-bullet-0"><span>Digital Pathology Association </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://digitalpathologyassociation.org/&amp;sa=D&amp;source=editors&amp;ust=1653997224934962&amp;usg=AOvVaw1eJKVZwl57Ouqz6BYmUTrn">https://digitalpathologyassociation.org/</a></span><span class="c2">&nbsp;</span></li><li class="c12 c18 li-bullet-0"><span>empaia Academy </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://en.empaia.org/academy-2-1&amp;sa=D&amp;source=editors&amp;ust=1653997224935192&amp;usg=AOvVaw3j4y0TLgZgWFwyLJvn7dqD">https://en.empaia.org/academy-2-1</a></span><span class="c2">&nbsp;</span></li><li class="c12 c18 li-bullet-0"><span>Patoloji Atlas&#305; </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.patolojiatlasi.com/&amp;sa=D&amp;source=editors&amp;ust=1653997224935422&amp;usg=AOvVaw1oVYaRBbIFsfvHiRs3NHfS">https://www.patolojiatlasi.com/</a></span><span class="c2">&nbsp;</span></li><li class="c12 c18 li-bullet-0"><span>Patoloji Notlar&#305; </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.patolojinotlari.com/&amp;sa=D&amp;source=editors&amp;ust=1653997224935634&amp;usg=AOvVaw0DmcNc95mJ3j7c4Iz6BWw0">https://www.patolojinotlari.com/</a></span><span class="c2">&nbsp;</span></li><li class="c12 c18 li-bullet-0"><span>QuPath </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://qupath.github.io/&amp;sa=D&amp;source=editors&amp;ust=1653997224935841&amp;usg=AOvVaw2q0lgMQB5Zj1yjW0Hox6WI">https://qupath.github.io/</a></span><span>&nbsp; Bankhead, P. et al. QuPath: Open source software for digital pathology image analysis. Scientific Reports (2017). </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://doi.org/10.1038/s41598-017-17204-5&amp;sa=D&amp;source=editors&amp;ust=1653997224936022&amp;usg=AOvVaw2S-9ATdf_s0ldGfWXenqQm">https://doi.org/10.1038/s41598-017-17204-5</a></span><span class="c2">&nbsp;</span></li><li class="c12 c18 li-bullet-0"><span>Pete Bankhead, 2022, Introduction to Bioimage Analysis </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://bioimagebook.github.io&amp;sa=D&amp;source=editors&amp;ust=1653997224936262&amp;usg=AOvVaw2irxvIzzYD-oX4XiyElxhA">https://bioimagebook.github.io</a></span></li><li class="c12 c18 li-bullet-0"><span>Best practice recommendations for implementing digital pathology, The Royal College of Pathologists </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.rcpath.org/uploads/assets/f465d1b3-797b-4297-b7fedc00b4d77e51/Best-practice-recommendations-for-implementing-digital-pathology.pdf&amp;sa=D&amp;source=editors&amp;ust=1653997224936562&amp;usg=AOvVaw2IcuuwJm-StKt56fl0OOBI">https://www.rcpath.org/uploads/assets/f465d1b3-797b-4297-b7fedc00b4d77e51/Best-practice-recommendations-for-implementing-digital-pathology.pdf</a></span></li><li class="c12 c18 li-bullet-0"><span>The Leeds Guide to Digital Pathology </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.virtualpathology.leeds.ac.uk/research/clinical/docs/2018/pdfs/18778_Leeds%2520Guide%2520to%2520Digital%2520Pathology_Brochure_A4_final_hi.pdf&amp;sa=D&amp;source=editors&amp;ust=1653997224936841&amp;usg=AOvVaw2l24ZAcakDRTaJXtT2m_hW">https://www.virtualpathology.leeds.ac.uk/research/clinical/docs/2018/pdfs/18778_Leeds%20Guide%20to%20Digital%20Pathology_Brochure_A4_final_hi.pdf</a></span></li><li class="c12 c18 li-bullet-0"><span>Leeds ekran testi: </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.virtualpathology.leeds.ac.uk/research/systems/pouqa/pathology/&amp;sa=D&amp;source=editors&amp;ust=1653997224937099&amp;usg=AOvVaw3qJszlUIedawRBiZon6wky">https://www.virtualpathology.leeds.ac.uk/research/systems/pouqa/pathology/</a></span></li><li class="c12 c18 li-bullet-0"><span>Integrating digital pathology into clinical practice </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://pubmed.ncbi.nlm.nih.gov/34599281/&amp;sa=D&amp;source=editors&amp;ust=1653997224937325&amp;usg=AOvVaw29zyAsh2HnLiahKCrDbhdP">https://pubmed.ncbi.nlm.nih.gov/34599281/</a></span></li><li class="c12 c18 li-bullet-0"><span>Artificial intelligence-the third revolution in pathology </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://pubmed.ncbi.nlm.nih.gov/30270453/&amp;sa=D&amp;source=editors&amp;ust=1653997224937554&amp;usg=AOvVaw0KqIJh8RsmpxxLiVNdT5J8">https://pubmed.ncbi.nlm.nih.gov/30270453/</a></span></li><li class="c12 c18 li-bullet-0"><span>Grand Challenge A platform for end-to-end development of machine learning solutions in biomedical imaging. </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://grand-challenge.org/&amp;sa=D&amp;source=editors&amp;ust=1653997224937799&amp;usg=AOvVaw2jQTzvt4yhBUytYryVEtxz">https://grand-challenge.org/</a></span></li><li class="c12 c18 li-bullet-0"><span>Manual Whole Slide Imaging </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.microvisioneer.com/&amp;sa=D&amp;source=editors&amp;ust=1653997224938050&amp;usg=AOvVaw33xlQR5sDDh9Q8aQZHHjgc">https://www.microvisioneer.com/</a></span></li><li class="c12 c18 li-bullet-0"><span>PathoZoom Scan </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.smartinmedia.com/pathozoom-scan/&amp;sa=D&amp;source=editors&amp;ust=1653997224938315&amp;usg=AOvVaw20PcziZmAKrcaLTynqLxpS">https://www.smartinmedia.com/pathozoom-scan/</a></span></li><li class="c12 c18 li-bullet-0"><span>Pallua JD, Brunner A, Zelger B, Schirmer M, Haybaeck J. </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://pubmed.ncbi.nlm.nih.gov/32825928/&amp;sa=D&amp;source=editors&amp;ust=1653997224938535&amp;usg=AOvVaw3hOL6Y-5rnNIbR-qhKGh1w">The future of pathology is digital</a></span><span class="c2">&nbsp;Pathol Res Pract. 2020 Sep;216(9):153040. doi: 10.1016/j.prp.2020.153040. Epub 2020 Jun 20. PMID: 32825928.</span></li><li class="c12 c18 li-bullet-0"><span class="c35"><a class="c3" href="https://www.google.com/url?q=https://www.youtube.com/watch?v%3DnVHRNn-nqMg&amp;sa=D&amp;source=editors&amp;ust=1653997224938786&amp;usg=AOvVaw2uyUUNCK7_yK6vAbcRcpSq">Petascale Computational Pathology - Prof Nasir Rajpoot at HMS-BWH Pathology Grand Rounds 5 Oct 2020</a></span></li><li class="c31 c18 li-bullet-0"><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://medical.sectra.com/case/advice-from-one-of-the-worlds-largest-digital-pathology-implementations/?utm_source%3Dlinkedin.com%26utm_medium%3Dsocial%26utm_campaign%3Dhimss&amp;sa=D&amp;source=editors&amp;ust=1653997224939049&amp;usg=AOvVaw2K_QgMgi-OdQXQoqyUCesV">Advice from one of the world&#39;s largest digital pathology implementations</a></span></li><li class="c31 c18 li-bullet-0"><span>Octopi: Octopi: Open configurable high-throughput imaging platform for infectious disease diagnosis in the field </span><span class="c44">Hongquan Li, Hazel Soto-Montoya, Maxime Voisin, Lucas Fuentes Valenzuela, Manu Prakash bioRxiv 684423; doi: https://doi.org/10.1101/684423</span></li><li class="c31 c18 li-bullet-0"><span>Octopi&rsquo;nin tan&#305;t&#305;m&#305;: </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://twitter.com/prakashlab/status/1144453714637230083&amp;sa=D&amp;source=editors&amp;ust=1653997224939489&amp;usg=AOvVaw260oeNg_Y8Qh3kU3WKpFz5">https://twitter.com/prakashlab/status/1144453714637230083</a></span></li><li class="c31 c18 li-bullet-0"><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://link.springer.com/article/10.1007/s00428-021-03123-4&amp;sa=D&amp;source=editors&amp;ust=1653997224939764&amp;usg=AOvVaw1fI3kDl8S_VJ-txa20P1m-">Lesson from the COVID-19 pandemic: pathologists need to build their confidence on working in a digital microscopy environment - Virchows Archiv</a></span><span>&nbsp;</span><span class="c23">Montironi, R., Cimadamore, A., Cheng, L. </span><span class="c19">et al.</span><span class="c23">&nbsp;Lesson from the COVID-19 pandemic: pathologists need to build their confidence on working in a digital microscopy environment. </span><span class="c19">Virchows Arch</span><span class="c23">&nbsp;479, 227&ndash;229 (2021). https://doi.org/10.1007/s00428-021-03123-4</span></li><li class="c31 c18 li-bullet-0"><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.cap.org/protocols-and-guidelines/cap-guidelines/current-cap-guidelines/validating-whole-slide-imaging-for-diagnostic-purposes-in-pathology&amp;sa=D&amp;source=editors&amp;ust=1653997224940145&amp;usg=AOvVaw3XMgoVfS9JqCMA8VJt9ab5">Validating Whole Slide Imaging for Diagnostic Purposes in Pathology</a></span><span class="c2">&nbsp;https://www.cap.org/protocols-and-guidelines/cap-guidelines/current-cap-guidelines/validating-whole-slide-imaging-for-diagnostic-purposes-in-pathology</span></li><li class="c18 c31 li-bullet-0"><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://meridian.allenpress.com/aplm/article/doi/10.5858/arpa.2020-0723-CP/464968/Validating-Whole-Slide-Imaging-Systems-for&amp;sa=D&amp;source=editors&amp;ust=1653997224940419&amp;usg=AOvVaw3TFFV_J7FaaLQWIo_iz4VL">Validating Whole Slide Imaging Systems for Diagnostic Purposes in Pathology: Guideline Update From the College of American Pathologists in Collaboration With the American Society for Clinical Pathology and the Association for Pathology Informatics | Archives of Pathology &amp; Laboratory Medicine</a></span><span>&nbsp;</span><span class="c20 c30">Andrew J Evans, Richard W. Brown, Marilyn M. Bui, Elizabeth A. Chlipala, Christina Lacchetti, Danny A. Milner, Liron Pantanowitz, Anil V. Parwani, Kearin Reid, Michael W. Riben, Victor E. Reuter, Lisa Stephens, Rachel L. Stewart, Nicole E. Thomas; Validating Whole Slide Imaging Systems for Diagnostic Purposes in Pathology: Guideline Update From the College of American Pathologists in Collaboration With the American Society for Clinical Pathology and the Association for Pathology Informatics. </span><span class="c20 c30 c40">Arch Pathol Lab Med</span><span class="c20 c30">&nbsp;1 April 2022; 146 (4): 440&ndash;450. doi: </span><span class="c20 c37"><a class="c3" href="https://www.google.com/url?q=https://doi.org/10.5858/arpa.2020-0723-CP&amp;sa=D&amp;source=editors&amp;ust=1653997224940663&amp;usg=AOvVaw2gbS-SJ7Iv8lph--KdVYGe">https://doi.org/10.5858/arpa.2020-0723-CP</a></span></li><li class="c28 c18 li-bullet-0"><span>Digital Pathology &amp; AI in routine clinical practice:From quality control to primary cancer diagnosis </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.youtube.com/watch?v%3D7pRmonus9iM&amp;sa=D&amp;source=editors&amp;ust=1653997224940881&amp;usg=AOvVaw3dObxl0DEQghqE8KbwSjje">https://www.youtube.com/watch?v=7pRmonus9iM</a></span></li><li class="c28 c18 c41 li-bullet-0"><span class="c38">Atallah, N.M., Toss, M.S., Verrill, C. </span><span class="c33">et al.</span><span class="c38">&nbsp;Potential quality pitfalls of digitalized whole slide image of breast pathology in routine practice. </span><span class="c33">Mod Pathol</span><span class="c38">&nbsp;(2021). https://doi.org/10.1038/s41379-021-01000-8</span></li></ul><p class="c6"><span class="c2"></span></p><ul class="c25 lst-kix_h94nde2svjvq-0 start"><li class="c12 c18 li-bullet-0"><span class="c2">A&ccedil;&#305;k kaynak kodlu ya da &uuml;cretsiz dijital patoloji programlar&#305;:</span></li></ul><ul class="c25 lst-kix_h94nde2svjvq-1 start"><li class="c12 c27 li-bullet-0"><span>QuickAnnotator </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://github.com/choosehappy/QuickAnnotator&amp;sa=D&amp;source=editors&amp;ust=1653997224941386&amp;usg=AOvVaw2KyrFAO9s2Y69cZkYGUTix">https://github.com/choosehappy/QuickAnnotator</a></span></li><li class="c12 c27 li-bullet-0"><span>HistoQC </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://github.com/choosehappy/HistoQC&amp;sa=D&amp;source=editors&amp;ust=1653997224941584&amp;usg=AOvVaw2zO3JRla9XsiLswJFV-5jO">https://github.com/choosehappy/HistoQC</a></span></li><li class="c12 c27 li-bullet-0"><span>QuPath </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://qupath.github.io/&amp;sa=D&amp;source=editors&amp;ust=1653997224941788&amp;usg=AOvVaw2GGCn6EdlB6KMYVY3jOnUo">https://qupath.github.io/</a></span></li><li class="c12 c27 li-bullet-0"><span>Cytomine </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://cytomine.be/&amp;sa=D&amp;source=editors&amp;ust=1653997224941975&amp;usg=AOvVaw2ZEmpHPPDgIrUCoclKgayW">https://cytomine.be/</a></span></li><li class="c12 c27 li-bullet-0"><span>Orbit </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.orbit.bio/&amp;sa=D&amp;source=editors&amp;ust=1653997224942170&amp;usg=AOvVaw3BCfHv2luic0jsfhS-gdxM">https://www.orbit.bio/</a></span></li><li class="c12 c27 li-bullet-0"><span>ASAP </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://computationalpathologygroup.github.io/ASAP/&amp;sa=D&amp;source=editors&amp;ust=1653997224942378&amp;usg=AOvVaw0_waqztDfurZsnujAiaZhW">https://computationalpathologygroup.github.io/ASAP/</a></span></li><li class="c12 c27 li-bullet-0"><span>Micaia </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=http://www.micaia.ai&amp;sa=D&amp;source=editors&amp;ust=1653997224942599&amp;usg=AOvVaw2gWwanxrD0h3FNEriIzVxS">http://www.micaia.ai</a></span></li><li class="c12 c27 li-bullet-0"><span>ImageJ/ Fiji </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://fiji.sc/&amp;sa=D&amp;source=editors&amp;ust=1653997224942792&amp;usg=AOvVaw0DtZVPV_UwEJs1O1BkDZuY">https://fiji.sc/</a></span></li><li class="c12 c27 li-bullet-0"><span>ImageScope </span><span class="c8"><a class="c3" href="https://www.google.com/url?q=https://www.leicabiosystems.com/digital-pathology/manage/aperio-imagescope/&amp;sa=D&amp;source=editors&amp;ust=1653997224943020&amp;usg=AOvVaw1uIPrc6KFdot729aGY1u3Z">https://www.leicabiosystems.com/digital-pathology/manage/aperio-imagescope/</a></span></li></ul><p class="c6"><span class="c2"></span></p></body></html>